{
    "AL_ALSE-134300517": {
        "serff_tr_num": "ALSE-134300517",
        "filing_type": "Model - Other",
        "date_submitted": "10/29/2024",
        "effective_date_requested_new": "",
        "effective_date_requested_renewal": "",
        "serff_status": "Closed-Approved",
        "filing_description": "With this filing, Allstate is stating its intention to introduce a new Homeowners program using the enclosed Geographic and\nHurricane Rate Plan Models in a subsequent rate filing. Further information regarding this model can be found in the enclosed\nattachments.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 8,
        "company_codes": [
            11110
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "Summary of the Rate Filing:\n- Company: Allstate North American Insurance Company\n- Product Name: ANAIC HO (Homeowners Insurance)\n- State: Alabama\n- Type of Insurance: Homeowners (Owner Occupied)\n- Filing Type: Model - Other\n- Date Submitted: 10/29/2024\n- SERFF Tracking #: ALSE-134300517\n- Filing Status: Closed-Approved\n- Effective Date: On Approval\n- Filing Contact: Rhonda Amann (State Filings Manager)\n- Filing Description: Allstate is introducing a new Homeowners insurance program using Geographic and Hurricane Rate Plan Models in a subsequent rate filing.\n- Filing Fee: $100.00 (Property, Casualty, Marine, and Surety Model filing)\n\nOverall, the rate filing involves the introduction of a new Homeowners insurance program by Allstate in Alabama, utilizing specific Geographic and Hurricane Rate Plan Models. The filing has been approved by the state and the company has outlined its intention to implement this new program upon approval.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "AL_LBPM-134436753": {
        "serff_tr_num": "LBPM-134436753",
        "filing_type": "Rate",
        "date_submitted": "02/26/2025",
        "effective_date_requested_new": "04/01/2025",
        "effective_date_requested_renewal": "05/06/2025",
        "serff_status": "Closed-Approved",
        "filing_description": "With this revision, Liberty Mutual Insurance Company (LMIC) and Peerless Indemnity Insurance Company (PIIC) request to\nrevise their rating factors within their homeowner program. These revisions will be effective for new business policies written\non or after April 1, 2025 and renewal business policies renewing on or after May 6, 2025. The overall rate effect for this change\nis -25.0%.\nRate Revisions:\n•Base Rates\n•Fixed Expense\n•Fixed Expense (Landlord)\nThe applicable filing materials are included with this SERFF submission.\nThank you for reviewing our filing. We look forward to your acknowledgement. If you have any questions or need additional\ninformation, please contact us.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 111,
        "company_codes": [
            23043,
            18333
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "The rate filing submitted by Liberty Mutual Insurance Company and Peerless Indemnity Insurance Company for their Homeowners insurance product in Alabama includes revisions to the rating factors within their homeowner program. The effective date for these revisions is specified as April 1, 2025, for new business policies and May 6, 2025, for renewal business policies. The overall rate effect for this change is noted as a decrease of -25.0%.\n\nThe filing includes modifications to various rate components such as Base Rates, Fixed Expenses, and Fixed Expenses for Landlord properties. The documents submitted with the filing provide detailed information on the changes made to each component, including base rates and expense rates. The filing also mentions the approval status, with the disposition date noted as February 27, 2025, and a status of \"Closed-Approved.\"\n\nThe companies involved, Liberty Mutual Insurance Company and Peerless Indemnity Insurance Company, have provided detailed contact information for further inquiries related to the filing. The filing includes a description of the rate revisions, information on the associated fees, details on any models used in the calculation of rates, and the statutory guidelines followed for trade secret confidentiality.\n\nOverall, the rate filing aims to adjust the rating factors for the Homeowners insurance product in Alabama, with the changes expected to benefit policyholders through a reduced overall rate effect.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "AR_TRVD-G134425501": {
        "serff_tr_num": "TRVD-G134425501",
        "filing_type": "Rule",
        "date_submitted": "02/25/2025",
        "effective_date_requested_new": "04/13/2025",
        "effective_date_requested_renewal": "06/02/2025",
        "serff_status": "Closed-Filed",
        "filing_description": "With this filing we are revising our Quantum Homeowners 2.0, Quantum Homeowners and Homeowners products as detailed\nin the accompanying documentation.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 3548,
        "company_codes": [
            19062,
            19070,
            27998,
            25666,
            36137,
            38130
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "Based on the filing provided, here is a summary of the rate filing for the insurance company in Arkansas:\n\n1. **Companies Listed:** The Automobile Insurance Company of Hartford, Connecticut; The Standard Fire Insurance Company; The Travelers Home and Marine Insurance Company; The Travelers Indemnity Company of America; Travelers Commercial Insurance Company; Travelers Personal Insurance Company\n\n2. **Product Name:** Quantum Homeowners 2.0, Quantum Homeowners, Homeowners\n\n3. **State:** Arkansas\n\n4. **Type of Insurance:** Homeowners insurance\n\n5. **Filing Type:** Rule\n\n6. **Effective Date Requested:** \n   - New: 04/13/2025\n   - Renewal: 06/02/2025\n\n7. **Overall Rate Impact:** 0.000%\n\n8. **Additional Coverages and Enhancements:** The filing includes various additional coverages and enhancements such as High Value Home Coverage, Loss Assessment Coverage, Enhanced Home Package, and more.\n\n9. **Premium Adjustments:** Premium adjustments are made based on factors like construction type, protection class, coverage limits, and additional coverages chosen by the insured.\n\n10. **Endorsements:** Endorsements like ACE Endorsement, Loss Assessment Coverage, Dwelling Under Construction Coverage, and Identity Fraud Expense Reimbursement Coverage are available for added protections.\n\n11. **Optional Coverages:** Optional coverages are offered for building additions, increased limits for business property,",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "AZ_TRVD-134038097": {
        "serff_tr_num": "TRVD-134038097",
        "filing_type": "Rule",
        "date_submitted": "03/21/2024",
        "effective_date_requested_new": "04/28/2024",
        "effective_date_requested_renewal": "",
        "serff_status": "Closed-Acknowledged",
        "filing_description": "With this filing, we are submitting AZ Specific Travelers Insurance Score Model as detailed in the accompanying\ndocumentation.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 3548,
        "company_codes": [
            27998,
            36137
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "The rate filing is a submission by The Travelers Home and Marine Insurance Company for their product TIS 1.0 in Arizona for homeowners insurance. The filing involves a rule change and was submitted on 03/21/2024. The effective date requested for both new business and renewals is 04/28/2024. The filing has been acknowledged by the state, with a disposition date of 02/28/2025. The filing includes objections from the Department of Insurance related to model validation, statistical testing, model outputs, and other compliance issues. The objections have triggered responses from the company addressing each specific objection in detail. The correspondence includes extension requests and responses to objections from the state reviewer, Kim Richardson. The company's Regulatory Analyst, Kim Richardson, is the primary contact for the filing.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "AZ_TRVD-G134416866": {
        "serff_tr_num": "TRVD-G134416866",
        "filing_type": "Rate",
        "date_submitted": "02/13/2025",
        "effective_date_requested_new": "",
        "effective_date_requested_renewal": "04/26/2025",
        "serff_status": "Closed-Acknowledged",
        "filing_description": "With this filing we are amending our Homeowners program as detailed in the accompanying Explanatory Memorandum.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 3548,
        "company_codes": [
            27998,
            36137
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "The insurance company, The Travelers Home and Marine Insurance Company, has submitted a rate filing for its Quantum Homeowners & High Value Homeowners - Dwelling product in the state of Arizona. The filing includes amendments to their Homeowners program, with a +8.0% impact on Dwelling. The filing is a rate increase type with an overall percentage rate indicated for this filing at 22.000%. The effective date requested for the renewal is 04/26/2025.\n\nThe rate filing was submitted on 02/13/2025 and was acknowledged with a disposition date of 02/27/2025. The filing includes multiple companies under The Travelers brand, such as The Travelers Home and Marine Insurance Company and Travelers Commercial Insurance Company. The filing company's project name/number is PIECSR-581/2025-02-0704A.\n\nVarious supporting documents and schedules have been filed alongside the rate changes, such as the Actuarial Supporting Exhibit Requirements, the General Filing Checklist and Instructions for All Lines, and others. Additionally, objections and responses have been submitted regarding the rate changes, addressing concerns about the indicated rate change and steps taken to reduce the possibility of inadequate rates.\n\nThe rate change is based on thorough analysis, considering factors like past and prospective loss experience, catastrophe hazards, underwriting profit, and industry trends. The insurer has detailed methodologies and calculations supporting the rate adjustments, including factors like Premium Trend, Loss Trend, Catastrophe Loss",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "AZ_TRVD-G134417169": {
        "serff_tr_num": "TRVD-G134417169",
        "filing_type": "Rate",
        "date_submitted": "02/13/2025",
        "effective_date_requested_new": "",
        "effective_date_requested_renewal": "04/26/2025",
        "serff_status": "Closed-Acknowledged",
        "filing_description": "With this filing we are amending our Homeowners program as detailed in the accompanying Explanatory Memorandum.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 3548,
        "company_codes": [
            27998,
            36137
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "Based on the provided filing information, it appears that The Travelers Home and Marine Insurance Company and Travelers Commercial Insurance Company have submitted a rate filing for their Quantum Homeowners & High Value Homeowners - Condo products in the state of Arizona. Here is a summary of the key details from the filing:\n\n1. **Product Name**: Quantum Homeowners & High Value Homeowners - Condo\n2. **Companies**: The Travelers Home and Marine Insurance Company, Travelers Commercial Insurance Company\n3. **State**: Arizona\n4. **Type of Filing**: Rate\n5. **Effective Date Requested**: New – 04/26/2025; Renewal – 04/26/2025\n6. **Overall Rate Impact**:\n   - The Travelers Home and Marine Insurance Company: 11.7% indicated change, 2.0% rate impact\n   - Travelers Commercial Insurance Company: 11.7% indicated change, 2.0% rate impact\n7. **Filing Status**: Acknowledged\n8. **SERFF Status**: Closed-Acknowledged\n9. **Filing Contact**: Kim Richardson, Sr. Regulatory Analyst\n   - Email: klricha2@travelers.com\n   - Phone: 865-777-6535\n10. **Company Information**:\n   - The Travelers Home and Marine Insurance Company:\n     - Address: One Tower Square, Hartford, CT 06183",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "CA_ALSE-134306035": {
        "serff_tr_num": "ALSE-134306035",
        "filing_type": "Rule",
        "date_submitted": "11/01/2024",
        "effective_date_requested_new": "05/01/2025",
        "effective_date_requested_renewal": "05/01/2025",
        "serff_status": "Closed-Approved",
        "filing_description": "With this filing, Encompass Insurance Company proposes revisions to its Homeowners Underwriting Guidelines in the state of\nCalifornia.\nPlease see the Filing Memorandum and Supporting Documents for more information regarding the revisions proposed in this\nfiling.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 8,
        "company_codes": [
            10358
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "Here is a detailed summary of the objections and responses highlighted in the filings related to the underwriting guidelines of Encompass Insurance Company:\n\n1. **Objection 1 (Addressed in Response 1 on 01/06/2025):**\n   - **Summary:** The objection raised concerns about changes in the wildfire risk score and their impact on policyholders. Specific questions were posed regarding policyholder impact and reasons for the changes.\n   - **Response:** Encompass detailed their mitigation efforts against wildfire risk, explaining the rationale behind changing the renewal wildfire score to 20. They clarified that there is no rate impact as Encompass does not rate on wildfire score.\n\n2. **Objection 2 (Addressed in Response 1 on 01/17/2025):**\n   - **Summary:** This objection pertained to the determination of current rates sufficiency, the premium amount for policies planned for non-renewal, and the process for non-renewals.\n   - **Response:** Encompass reviewed loss experience for different wildfire risk score categories and determined that current rates are sufficient. The premium amount for non-renewal policies was $3,688,724, and no non-renewals had started as of their response date. Encompass planned to start non-renewals on 5/1/25 but paused this due to wildfire moratoriums.\n\n3. **Objection 3 (Addressed in Response 1 on 01/28/2025):",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "CA_LBRM-134233558": {
        "serff_tr_num": "LBRM-134233558",
        "filing_type": "Rule",
        "date_submitted": "09/03/2024",
        "effective_date_requested_new": "04/19/2025",
        "effective_date_requested_renewal": "04/19/2025",
        "serff_status": "Closed-Approved",
        "filing_description": "We are submitting a Rule Filing for the Safeco Insurance Company of America, Safeco Insurance Company of Illinois, and\nFirst National Insurance Company of America. With this filing, we are making updates to our eligibility guidelines to clarify and\nrefine our appetite.\nIf we can answer any questions or provide additional information, please do not hesitate to contact us.\nThank you for your time and consideration.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 111,
        "company_codes": [
            24724,
            24740,
            39012
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "The rate filing submitted by First National Insurance Company of America, Safeco Insurance Company of America, and Safeco Insurance Company of Illinois pertains to homeowners insurance in California. The filing includes updates to the eligibility guidelines and rules to clarify and refine their underwriting appetite. The effective date requested for both new business and renewal business is 04/19/2025. The filing was submitted on 09/03/2024 and was approved with a disposition date of 03/03/2025. The filing encompasses changes to the Product Guide, Eligibility Guidelines, and supporting documents, with no rate changes indicated. The disposition status is approved, and the changes specified in the application have been approved for implementation.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "CA_LBRM-134354159": {
        "serff_tr_num": "LBRM-134354159",
        "filing_type": "Rate/Rule/Form",
        "date_submitted": "12/17/2024",
        "effective_date_requested_new": "01/01/2026",
        "effective_date_requested_renewal": "01/01/2026",
        "serff_status": "Closed-Acknowledged",
        "filing_description": "In accordance with the California Department of Insurance, First National Insurance Company of America is formally\nsubmitting a withdrawal filing for its Legacy Homeowners Product. Safeco Insurance submits the attached withdrawal notice\npursuant to CIC § 674.6 which requires 60 days advance notice to the department for the withdrawal of a product.  We have\nalready submitted updated indications reflecting policy impacts within our pending rate filing, SERFF # LBRM-134134101.\nWe are simplifying and focusing our investments on core go-forward products and will no longer be offering this product in the\nstate of California within First National Insurance Company of America.\nBelow are the complete filing exhibits:\n- Prior Approval Rate Application: The latest rate filings are identified. This would be a Form/Rate/Rule 0.0% rate change.\n- Exhibit 1 Filing History: Listed are the previously approved CDI filing numbers for the last three years.\n- Withdrawal Letter\n- Non-renewal Notice",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 111,
        "company_codes": [
            24724
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "Based on the filing provided, the First National Insurance Company of America is formally submitting a withdrawal filing for its Legacy Homeowners Product in the state of California. The withdrawal is effective as of January 1, 2026, and the company has affirmed that it will not renew any policies from the withdrawn program into any similar programs offered by the same insurer group in California. Additionally, the company has agreed not to file a replacement program for at least 3 years after the effective date of the withdrawal.\n\nKey Points from the Filing:\n1. **Company Information:** \n   - Filing Company: First National Insurance Company of America\n   - Domiciled in: New Hampshire\n   - State of Filing: California\n   - Product Name: Homeowners\n\n2. **Filing Details:**\n   - **Effective Date Requested:** 01/01/2026\n   - **Filing Type:** Rate/Rule/Form\n   - **Disposition Status:** Acknowledged\n\n3. **Submitted Documents and Changes:**\n   - Withdrawal Letter\n   - Non-Renewal Notice\n   - New Prior Approval Rate Application\n   - Exhibit 1 - Legacy\n   - PriorAppRateAPL Forms\n   - Product Guide changes\n   \n4. **Correspondence Summary:**\n   - Series of Objection and Response Letters exchanged between Christine Ray and Yizun Chen regarding the withdrawal and non-renewal process.\n\nOverall, the filing indicates a strategic decision",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "CO_LBPM-134412448": {
        "serff_tr_num": "LBPM-134412448",
        "filing_type": "Rate",
        "date_submitted": "02/14/2025",
        "effective_date_requested_new": "04/14/2025",
        "effective_date_requested_renewal": "05/31/2025",
        "serff_status": "Closed-Filed",
        "filing_description": "With this filing effective April 14, 2025, for New Business and May 31, 2025, for Renewal Business; Safeco Insurance\nCompany of America and American Economy Insurance Company are proposing updates to our Dwelling and Condominium\nproducts currently on file with your department. The updates are as follows.\nSafeco insurance Company of America:\n-Home: Base Rates\n-Home: Package Unities\n-Home: Roof Age\n-Condo: Base Rates\n-Condo: Loss Assessment\nAmerican Economy Insurance Company\n-Condo: Base Rates\n-Condo: Coverage A Base\n-Condo: Loss Assessment\nSafeco Insurance Company of America home will have an impact of 13% and condo will have an impact of 35.9%. American\nEconomy Insurance Company will have a total impact of 36.0%.\nThis filing does not contain any confidential information. Should the need arise in the future to submit confidential information\nunder this filing, we will submit a confidentiality index.\nFor our GLM documentation in Safeco Insurance Company of America, please see SERFF filing # LBPM-131128190. There\nare no changes to our GLM with this filing and we are providing this information to satisfy the state specific question regarding\nGLMs.\nFor our GLM documentation in American Economy Insurance Company, please see SERFF filing LBPM-132085715. There\nare no changes to our GLM with this filing and we are providing this information to satisfy the state specific question regarding\nGLMs.\nThank you for reviewing our filing. If you have any questions or need any additional information, please feel free to contact us.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 111,
        "company_codes": [
            19690,
            24740
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "The rate filing document provides detailed information on the proposed updates for Dwelling and Condominium products by Safeco Insurance Company of America and American Economy Insurance Company in Colorado. Here is a summary of the key points from the filing:\n\n- Companies Involved:\n  - American Economy Insurance Company\n  - Safeco Insurance Company of America\n\n- Product Name: Homeowners\n\n- Type of Filing: Rate\n- Date Submitted: 02/14/2025\n\n**American Economy Insurance Company:**\n- Proposed Updates for Condominium Products:\n  - Base Rates\n  - Coverage A Base\n  - Loss Assessment\n- Overall Impact: 36.0%\n\n**Safeco Insurance Company of America:**\n- Proposed Updates for Homeowners Products:\n  - Base Rates\n  - Package Unities\n  - Roof Age\n- Proposed Updates for Condominium Products:\n  - Base Rates\n  - Loss Assessment\n- Impact:\n  - Homeowners: 13%\n  - Condominium: 35.9%\n\n- Overall Rate Information:\n  - Overall Percentage Rate Indicated For This Filing: 19.6%\n  - Overall Percentage Rate Impact For This Filing: 15.2%\n  - Effective Date Requested (New): 04/14/2025\n  - Effective Date Requested (Renewal): 05/31/2025\n\n- Filing Notes:\n  - The filing has been reviewed and filed with a",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "CO_LEMO-134207600": {
        "serff_tr_num": "LEMO-134207600",
        "filing_type": "Loss Cost",
        "date_submitted": "08/19/2024",
        "effective_date_requested_new": "10/09/2024",
        "effective_date_requested_renewal": "12/08/2024",
        "serff_status": "Closed-Filed",
        "filing_description": "Lemonade respectfully submits this filing for the State's review. The proposed rate level change is 35.0% for HO-3, 1.0% for\nHO-4, and 35.0% for HO-6 for an all-forms rate impact of 19.74%. The proposed new and renewal business effective dates are\n10/8/24 and 12/7/2024.\nPlease see the explanatory memorandum for further details.\nThank you for your consideration.\n**This filing contains confidential information. Please refer to the Confidentiality Index attached to the Supporting\nDocumentation tab.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 5032,
        "company_codes": [
            16023
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "- **Company Name:** Lemonade Insurance Company\n- **Product Name:** Homeowners\n- **State:** Colorado\n- **Type of Insurance:** Homeowners\n- **Filing Type:** Loss Cost\n- **Overall % Indicated Change:** 27.210%\n- **Overall % Rate Impact:** 19.740%\n- **Written Premium Change for this Program:** $3,287,215\n- **Number of Policy Holders Affected for this Program:** 50,821\n- **Written Premium for this Program:** $16,652,557\n- **Maximum % Change (where required):** 48.530%\n- **Minimum % Change (where required):** 0.000%\n- **Requested Rate Level Changes:** 35.0% for HO-3, 1.0% for HO-4, and 35.0% for HO-6, resulting in an all-forms rate impact of 19.74%\n- **Effective Date Requested (New):** 10/09/2024\n- **Effective Date Requested (Renewal):** 12/08/2024\n\nThis rate filing includes various supporting documents such as regulatory filings, rate/rule attachments, actuarial supporting exhibits, inquiry responses, and a confidentiality index. Lemonade Insurance Company has proposed a significant rate level change, with specific adjustments for different types of homeowners policies, and has requested specific effective dates for implementing these changes.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "CO_USAA-134337652": {
        "serff_tr_num": "USAA-134337652",
        "filing_type": "Rate",
        "date_submitted": "12/04/2024",
        "effective_date_requested_new": "01/14/2025",
        "effective_date_requested_renewal": "04/01/2025",
        "serff_status": "Closed-Filed",
        "filing_description": "Based on a review of the latest Homeowners experience, United Services Automobile Association (USAA), USAA-Casualty\nInsurance Company (USAA-CIC), USAA-General Indemnity Company (USAA-GIC), and Garrison Property and Casualty\nInsurance Company (Garrison) propose revision to Homeowners premium rates with an overall effect of 6.0% to be effective\n1/14/2025 for new business and 4/1/2025 for renewal business.\nThere are no confidential items in this filing.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 200,
        "company_codes": [
            25941,
            25968,
            18600,
            21253
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "The rate filing submitted by United Services Automobile Association (USAA), USAA Casualty Insurance Company (USAA-CIC), USAA General Indemnity Company (USAA-GIC), and Garrison Property and Casualty Insurance Company includes the following key details:\n\n1. **Filing Description:** The filing proposes a revision to Homeowners premium rates with an overall effect of 6.0%, to be effective for new business on 1/14/2025 and for renewal business on 4/1/2025.\n   \n2. **Companies:** United Services Automobile Association, USAA Casualty Insurance Company, USAA General Indemnity Company, and Garrison Property and Casualty Insurance Company are involved in the filing.\n   \n3. **Rate Changes:** The overall rate impact and changes for the companies vary with USAA at 8.8%, USAA-CIC at 6.3%, USAA-GIC at 2.5%, and Garrison at 1.5%.\n   \n4. **Exhibits:** The filing includes supporting exhibits such as the Underwriting Profit & Contingency Provision, Investment income table of contents, and more to support the rate changes.\n\nThis filing aims to ensure that the rates are adequate and comply with the regulatory standards for Homeowners insurance in the state of Colorado. It also includes detailed explanations of the rate changes, targeting underwriting profits, and contingency provisions for each company within the group. Additionally, the filing mentions the use",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "CT_TRVD-G134412788": {
        "serff_tr_num": "TRVD-G134412788",
        "filing_type": "Rate/Rule",
        "date_submitted": "02/26/2025",
        "effective_date_requested_new": "05/18/2025",
        "effective_date_requested_renewal": "07/24/2025",
        "serff_status": "Submitted to State",
        "filing_description": "With this filing were are making revisions to our Quantum Homeowners 2.0 Program per the accompanying filing\nmemorandum.\nThis change applies to new business issued and effective on or after 05/18/2025, and to renewal business issued on or after\n05/18/2025 and effective on or after 07/24/2025.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 3548,
        "company_codes": [
            38130
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "Based on the information provided in the rate filing, here is a summary of the key details:\n\n1. Company: Travelers Personal Insurance Company\n2. Product: Quantum Home 2.0\n3. State: Connecticut\n4. Type of Insurance: Homeowners (TOI: 04.0 Homeowners)\n5. Filing Type: Rate/Rule\n6. Effective Date Requested: New Business - 05/18/2025, Renewal Business - 07/24/2025\n7. Rate Change Type: Increase\n8. Overall Percentage of Last Rate Revision: 14.700%\n9. Previous Rate Revision Date: 04/26/2024\n10. Rate Filing Method: File & Use\n11. Number of Policy Holders Affected: 85,504\n12. Written Premium Change: $12,634,440\n13. Contact Information: Steven Harris, Sr. Regulatory Services Analyst, srharri2@travelers.com, 865-777-6181\n14. Territory Factors: Detailed tables for various territories and lines of coverage\n\nThe rate filing reflects an increase in rates for the Quantum Home 2.0 homeowners insurance product in Connecticut, with new rates set to take effect on 05/18/2025 for new business and 07/24/2025 for renewal business. The filing includes detailed rate and rule changes, as well as supporting documents such as base rates, territory factors",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "GA_ALSE-134333693": {
        "serff_tr_num": "ALSE-134333693",
        "filing_type": "Rate/Rule other than PPA",
        "date_submitted": "11/26/2024",
        "effective_date_requested_new": "03/01/2025",
        "effective_date_requested_renewal": "03/01/2025",
        "serff_status": "Closed-Acknowledged",
        "filing_description": "With this filing, Allstate is introducing Fortified Home Discount to the Allstate Fire and Casualty Insurance Company (AFCIC)\nHomeowners – Owner Occupied Homeowners (HO) program in the state of Georgia.\nFurther information regarding these changes can be found in the enclosed attachments. This change will apply to new\nbusiness written on or after 6/16/2025 and for renewals effective on or after 7/31/2025.\nThis filing company is closed to new business. Allstate has, however, supplied a new business effective date for special\nbusiness cases. For example, to accommodate a new business policy in the same company to a policyholder that has been\nreinstated, or if a cancel/re-write is necessary.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 8,
        "company_codes": [
            29688
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "Based on the information provided in the filing with the Department of Insurance (DOI), here are key details regarding Allstate Fire and Casualty Insurance Company's revision for AFCIC HO in Georgia:\n\n1. **Project Details:**\n   - **Product Name:** AFCIC HO\n   - **Project Name/Number:** Fortified Home Discount/RITM06297272\n   - **Effective Date Requested:** 03/01/2025\n\n2. **Filing Overview:**\n   - **Filing Type:** Rate/Rule other than PPA\n   - **Date Submitted:** 11/26/2024\n   - **Disposition Status:** Acknowledged\n   - **Effective Date:** 03/01/2025\n   - **Filing Contact:** Rhonda Amann, State Filings Manager\n   - **Company Tracking #:** R57116: FORTIFIED HOME DISCOUNT\n   - **SERFF Tracking #:** ALSE-134333693\n\n3. **Changes Introduced:**\n   - **Introduction of Fortified Home Discount:** Allstate is introducing a Fortified Home Discount to the AFCIC HO program for owner-occupied homeowners in Georgia.\n\n4. **Correspondence Summary:**\n   - Responses and objections handled in a timely manner.\n   - Compliance with DOI requirements and regulations.\n   - Rate indications and supporting documents submitted as required.\n\n5. **Manual Changes:**\n   - Manual sections revised to accommodate the Fortified Home Discount",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "GA_ALSE-134336829": {
        "serff_tr_num": "ALSE-134336829",
        "filing_type": "Rate/Rule other than PPA",
        "date_submitted": "12/02/2024",
        "effective_date_requested_new": "03/01/2025",
        "effective_date_requested_renewal": "03/01/2025",
        "serff_status": "Closed-Acknowledged",
        "filing_description": "With this filing, Allstate is introducing Fortified Home Discount to the Allstate Indemnity Company (AI) Homeowners –\nManufactured Home (MFH) program in the state of Georgia.\nFurther information regarding these changes can be found in the enclosed attachments.\nThis change will apply to new business written on or after 6/16/2025 and for renewals effective on or after 7/31/2025.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 8,
        "company_codes": [
            19240
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "Based on the information available in the filing, Allstate Indemnity Company is introducing the Fortified Home Discount to its Allstate Indemnity Company Homeowners - Manufactured Home (AI MFH) program in the state of Georgia. This change will apply to new business written on or after 6/16/2025 and for renewals effective on or after 7/31/2025. \n\nThe project name/number for this initiative is Fortified Home Discount/RITM06297678. The filing was submitted on 12/02/2024, with a disposition date of 03/03/2025, and the effective date requested for the new and renewal business is 03/01/2025. The filing was acknowledged and the SERFF status is closed-acknowledged.\n\nThe Company Tracking # for this filing is R57109: FORTIFIED HOME DISCOUNT, and the State-specific filing fee amount was $75.00. The filing fee was processed on 12/02/2024 at 01:05 PM under transaction #301807182.\n\nThe contact person for this filing is Rhonda Amann, the State Filings Manager, who can be reached at RAMA0@allstate.com or 847-402-3149 (phone). The company's domicile is Illinois, and the company is a Property and Casualty insurer.\n\nThe filing includes various attachments such as the Compliance Certification, Explanatory Memorandum",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "GA_ALSE-134336890": {
        "serff_tr_num": "ALSE-134336890",
        "filing_type": "Rate/Rule other than PPA",
        "date_submitted": "12/02/2024",
        "effective_date_requested_new": "03/01/2025",
        "effective_date_requested_renewal": "03/01/2025",
        "serff_status": "Closed-Acknowledged",
        "filing_description": "With this filing, Allstate is introducing Fortified Home Discount to the Allstate Insurance Company (AIC) Homeowners –\nMobilehome (MBH) program in the state of Georgia.\nFurther information regarding these changes can be found in the enclosed attachments.\nThis change will apply to new business written on or after 6/16/2025 and for renewals effective on or after 7/31/2025.\nThis filing company is closed to new business. Allstate has, however, supplied a new business effective date for special\nbusiness cases. For example, to accommodate a new business policy in the same company to a policyholder that has been\nreinstated, or if a cancel/re-write is necessary.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 8,
        "company_codes": [
            19232
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "This rate filing by Allstate Insurance Company introduces the Fortified Home Discount to its Mobile Home program in Georgia. The filing includes changes to the package premium calculation method, introducing new discounts for original owners, retired individuals, and members of approved groups. Additionally, the filing includes provisions for various coverages under Sections I and II, eligibility criteria, discount factors for protective devices, and details on Deductibles and Premium Group Numbers. The filing also outlines procedures for policy endorsements, premium determinations, and discounts for specific demographics such as retirees and Good Hands People. In summary, the rate filing introduces new pricing structures and discounts to enhance the insurance offerings for mobile homeowners in Georgia.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "GA_ALSE-134337450": {
        "serff_tr_num": "ALSE-134337450",
        "filing_type": "Rate/Rule other than PPA",
        "date_submitted": "12/02/2024",
        "effective_date_requested_new": "03/01/2025",
        "effective_date_requested_renewal": "03/01/2025",
        "serff_status": "Closed-Acknowledged",
        "filing_description": "With this filing, Allstate is introducing Fortified Home Discount to the Allstate Vehicle and Casualty Insurance Company\n(AVPIC) Homeowners – Owner Occupied Homeowners (HO) program in the state of Georgia.\nFurther information regarding these changes can be found in the enclosed attachments.\nThis change will apply to new business written on or after 6/16/2025 and for renewals effective on or after 7/31/2025.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 8,
        "company_codes": [
            37907
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "Based on the filing provided on Allstate Vehicle and Property Insurance Company introducing the Fortified Home Discount for homeowners in Georgia, the company has made several changes and adjustments. Here are the key aspects of the filing worth noting:\n\n1. **Introduction of Fortified Home Discount**: Allstate Vehicle and Property Insurance Company introduced the Fortified Home Discount for the Allstate Vehicle and Casualty Insurance Company Homeowners – Owner Occupied Homeowners program in Georgia.\n\n2. **Effective Date**: The requested effective date for the new business and renewal business affected by the Fortified Home Discount is 03/01/2025. The company has committed to performing an audit of impacted policyholders and processing corrective action refunds.\n\n3. **Filing Adjustments**: A comprehensive explanation and documentation of the Fortified Home Discount factors applied to premium components for Wind, Hail, and Hurricane perils were included, along with the approval of the Actuarial Standards of Practice.\n\n4. **Geographic/Demographic Data Elements**: The filing identified that zip code was the only geographic/demographic variable used to determine territorial relativities, as obtained directly from policyholders.\n\n5. **Credit Scoring Models**: No credit-related variables were updated with this filing. The Credit Scoring Models and Proprietary Information attachment confirmed this aspect.\n\n6. **Manual and Rule Changes**: The filing included updates to the Rates Manual, specifically PCP-1, PCP-2, PCP-3, and RP-13.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "GA_ALSE-134337637": {
        "serff_tr_num": "ALSE-134337637",
        "filing_type": "Rate/Rule other than PPA",
        "date_submitted": "12/02/2024",
        "effective_date_requested_new": "03/01/2025",
        "effective_date_requested_renewal": "03/01/2025",
        "serff_status": "Closed-Acknowledged",
        "filing_description": "With this filing, Allstate is introducing Fortified Home Discount to the Allstate Property and Casualty Insurance Company (APC)\nHomeowners – Owner Occupied Homeowners (HO) program in the state of Georgia.\nFurther information regarding these changes can be found in the enclosed attachments.\nThis change will apply to new business written on or after 6/16/2025 and for renewals effective on or after 7/31/2025.\nThis filing company is closed to new business. Allstate has, however, supplied a new business effective date for special\nbusiness cases. For example, to accommodate a new business policy in the same company to a policyholder that has been\nreinstated, or if a cancel/re-write is necessary.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 8,
        "company_codes": [
            17230
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "The rate filing from Allstate Property and Casualty Insurance Company for their APC HO Product in Georgia introduces the Fortified Home Discount to their Homeowners - Owner Occupied Homeowners program. The filing was submitted on December 2, 2024, with a requested effective date of March 1, 2025, for both new business and renewals. The filing was closed and acknowledged on March 3, 2025.\n\nKey details of the rate filing include:\n- Filing Type: Rate/Rule other than PPA\n- Company: Allstate Property and Casualty Insurance Company\n- Product Name: APC HO\n- State: Georgia\n- Project Name/Number: Fortified Home Discount/RITM06297486\n- Effective Date Requested: 03/01/2025\n- Author: Rhonda Amann\n- Reviewer: Jarrett Briscoe\n- SERFF Status: Closed-Acknowledged\n- State Status: Acknowledged\n- Disposition Status: Acknowledged\n- Disposition Date: 03/03/2025\n- Filing Fee: $75.00\n- Contact Information: Rhonda Amann, State Filings Manager\n\nThe Fortified Home Discount is intended to apply to new business written on or after June 16, 2025, and for renewals effective on or after July 31, 2025. The filing provided detailed changes to the manual, rating factors, and discounts",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "GA_ALSE-134337677": {
        "serff_tr_num": "ALSE-134337677",
        "filing_type": "Rate/Rule other than PPA",
        "date_submitted": "12/02/2024",
        "effective_date_requested_new": "03/01/2025",
        "effective_date_requested_renewal": "03/01/2025",
        "serff_status": "Closed-Acknowledged",
        "filing_description": "With this filing, Allstate is introducing Fortified Home Discount to the Allstate Insurance Company (AIC) Homeowners – Owner\nOccupied Homeowners (HO) program in the state of Georgia.\nFurther information regarding these changes can be found in the enclosed attachments.\nThis change will apply to new business written on or after 6/16/2025 and for renewals effective on or after 7/31/2025.\nThis filing company is closed to new business. Allstate has, however, supplied a new business effective date for special\nbusiness cases. For example, to accommodate a new business policy in the same company to a policyholder that has been\nreinstated, or if a cancel/re-write is necessary.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 8,
        "company_codes": [
            19232
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "Based on the information provided in the filing, it seems that Allstate Insurance Company has submitted a rate/rule filing for its AIC HO (Homeowners - Owner Occupied) program in the state of Georgia. The filing introduces the Fortified Home Discount, which will apply to new business written on or after 6/16/2025 and renewals effective on or after 7/31/2025.\n\nKey Details from the Filing:\n1. **Company Information:**\n   - Company Name: Allstate Insurance Company\n   - Domicile: Illinois\n   - Company Type: Property and Casualty\n   - Contact: Rhonda Amann, State Filings Manager\n\n2. **Filing Details:**\n   - Filing Type: Rate/Rule other than PPA\n   - Effective Date Requested: 03/01/2025\n   - SERFF Tracking Number: ALSE-134337677\n   - State Tracking #: Not provided\n   - Company Tracking #: R57117: FORTIFIED HOME DISCOUNT\n\n3. **Changes Introduced:**\n   - Introduction of Fortified Home Discount to the AIC HO program\n   - Specific eligibility criteria for the discount, including IBHS certification for dwellings\n   - Discount factors for Gold, Silver, and Roof levels\n   - Exclusion of policies with Windstorm and Hail Exclusion endorsement from the discount\n\n4. **Correspondence Summary:**\n   - Objection raised",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "GA_ALSE-134337686": {
        "serff_tr_num": "ALSE-134337686",
        "filing_type": "Rate/Rule other than PPA",
        "date_submitted": "12/02/2024",
        "effective_date_requested_new": "03/01/2025",
        "effective_date_requested_renewal": "03/01/2025",
        "serff_status": "Closed-Acknowledged",
        "filing_description": "With this filing, Allstate is introducing Fortified Home Discount to the Allstate Indemnity Company (AI) Homeowners – Owner\nOccupied Homeowners (HO) program in the state of Georgia.\nFurther information regarding these changes can be found in the enclosed attachments.\nThis change will apply to new business written on or after 6/16/2025 and for renewals effective on or after 7/31/2025.\nThis filing company is closed to new business. Allstate has, however, supplied a new business effective date for special\nbusiness cases. For example, to accommodate a new business policy in the same company to a policyholder that has been\nreinstated, or if a cancel/re-write is necessary.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 8,
        "company_codes": [
            19240
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "This filing by Allstate Indemnity Company in Georgia introduces the Fortified Home Discount to its Homeowners - Owner Occupied Homeowners (HO) program. The change is applicable to new business written on or after 6/16/2025 and renewals effective on or after 7/31/2025. The effective date requested for both new and renewal business is 03/01/2025.\n\nThe filing was submitted on 12/02/2024 and had a disposition date of 03/03/2025, with the status being acknowledged. The SERFF Tracking Number is ALSE-134337686.\n\nThe key elements of this filing include:\n1. Introduction of Fortified Home Discount.\n2. Description of the eligibility criteria for the discount.\n3. Summary of manual changes related to the new discount.\n4. Premium calculation options for the Homeowners program, including various discounts and factors.\n5. Credit Scoring Models and Proprietary Information.\n\nThe filing also includes general company and contact information, supporting documentation schedules, and a correspondence summary related to objection and response letters. Additionally, there are details on rate changes and a breakdown of the company's filing fees.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "GA_LEMO-134374428": {
        "serff_tr_num": "LEMO-134374428",
        "filing_type": "Form",
        "date_submitted": "02/06/2025",
        "effective_date_requested_new": "05/15/2025",
        "effective_date_requested_renewal": "05/16/2025",
        "serff_status": "Closed-Approved",
        "filing_description": "A revision to Lemonade’s homeowners insurance program is hereby submitted for the State’s review. Lemonade is introducing\na new optional coverage, Refrigerated Property Coverage. The Company respectfully requests that this filing apply to all new\nbusiness policies written on or after May 15, 2025 and to all renewal business effective on or after May 16, 2025.\nPlease refer to the Explanatory Memorandum for additional details.\nWe look forward to your review.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 5032,
        "company_codes": [
            16023
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "Based on the filing information provided for Lemonade Insurance Company's rate filing for homeowners insurance in Georgia, the primary update is the introduction of a new optional coverage named Refrigerated Property Coverage. This coverage is added as an endorsement to Lemonade's existing homeowners, renters, and condominium insurance forms in Georgia.\n\nThe Refrigerated Property Coverage endorsement provides coverage for up to $500 for property stored in freezers or refrigerators on the insured's residence premises. It covers direct losses caused by interruptions of electrical service to the refrigeration unit or mechanical failures of the unit storing the property, provided the refrigeration unit was maintained in proper working condition before the loss. The coverage comes with a special deductible where the insurer pays only the part of the loss that exceeds $100, with no other deductible applying to this coverage.\n\nThe rate filing includes the necessary form revisions and additional supporting documents, such as a Readability Certification confirming compliance with Georgia's readability standards. The submission was successfully approved and the effective date for the new coverage is requested to be May 15, 2025, for new business policies and May 16, 2025, for renewal business policies. Lemonade Insurance Company has paid the required state fees for the filing.\n\nOverall, the rate filing focuses on introducing a new optional coverage tailored towards providing additional protection for perishable items stored in freezers or refrigerators on the insured's property.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "GA_LEMO-134376013": {
        "serff_tr_num": "LEMO-134376013",
        "filing_type": "Rate/Rule other than PPA",
        "date_submitted": "02/06/2025",
        "effective_date_requested_new": "05/15/2025",
        "effective_date_requested_renewal": "05/16/2025",
        "serff_status": "Closed-Acknowledged",
        "filing_description": "A revision to Lemonade’s homeowners insurance program is hereby submitted for the State’s review. Lemonade is introducing\na new optional coverage, Refrigerated Property Coverage. The Company respectfully requests that this filing apply to all new\nbusiness policies written on or after May 15, 2025 and to all renewal business effective on or after May 16, 2025.\nPlease refer to the Explanatory Memorandum for additional details.\nWe look forward to your review.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 5032,
        "company_codes": [
            16023
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "Based on the filing information provided, Lemonade Insurance Company has introduced a new optional coverage called Refrigerated Property Coverage for their Homeowners program in Georgia. The requested effective dates for this new coverage are May 15, 2025, for new business policies and May 16, 2025, for renewal business policies. The filing includes rate tables and rules specifically related to Refrigerated Property Coverage, with available coverage limits of $100, $250, and $500.\n\nFurthermore, the Rate Order of Calculation has been updated to include rating variables related to Refrigerated Property Coverage. The actuarial memorandum states that there will be no rate impact due to the introduction of this new coverage. The supporting documents include an Explanatory Memorandum, Actuarial Memo, and exhibits detailing the proposed changes in the filing.\n\nLemonade Insurance Company has paid the required filing fee of $75.00 for this rate filing in Georgia. The company's compliance certification and transmittal forms have been submitted as part of the filing documentation. The filing has been acknowledged and the effective dates for the changes requested in the filing have been confirmed by the regulator.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "GA_TRVD-G134360540": {
        "serff_tr_num": "TRVD-G134360540",
        "filing_type": "Rate/Rule other than PPA",
        "date_submitted": "12/24/2024",
        "effective_date_requested_new": "03/01/2025",
        "effective_date_requested_renewal": "03/01/2025",
        "serff_status": "Closed-Acknowledged",
        "filing_description": "With this filing we are amending our Quantum Home 2.0 product as detailed in the attached memo.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 3548,
        "company_codes": [
            38130
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "The rate filing submitted by Travelers Personal Insurance Company for their Quantum Home 2.0 product in Georgia involves amendments to the Windstorm Mitigation Discount table. The filing includes updates to provide premium discounts to eligible policyholders in compliance with Georgia House Bill 279. The overall impact of the filing is indicated as +0.0%.\n\nThe proposed changes apply to both new business issued and effective on or after 2/28/2025, and to renewal business issued on or after 2/28/2025 with an effective date on or after 4/19/2025. The Explanatory Memorandum outlines the changes made to the Windstorm Mitigation Discount factors and the expected impact on policyholders.\n\nThe filing also includes information on the dwelling, tenant, condo, landlord dwelling, and landlord condo categories, showing the rate changes over a 3-year history in various aspects of the policy.\n\nOverall, the rate filing demonstrates Travelers' commitment to complying with regulatory requirements and enhancing their product offerings for policyholders in Georgia.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "GA_TRVD-G134400530": {
        "serff_tr_num": "TRVD-G134400530",
        "filing_type": "Rate/Rule other than PPA",
        "date_submitted": "02/03/2025",
        "effective_date_requested_new": "",
        "effective_date_requested_renewal": "02/28/2025",
        "serff_status": "Closed-Acknowledged",
        "filing_description": "With this filing we are making revisions to our Quantum Home, Quantum High Value Home, Homeowners, and High Value\nHomeowners programs as detailed in the attached memo.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 3548,
        "company_codes": [
            27998,
            36137,
            19070,
            19038,
            25658,
            36161,
            25623,
            19062,
            25615,
            25666,
            28188,
            25674
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "The rate filing submitted by The Travelers Home and Marine Insurance Company in Georgia involves revisions to their Quantum Home, Quantum High Value Home, Homeowners, and High Value Homeowners programs. The filing introduces Windstorm Mitigation Discounts for various property types, with specific eligibility criteria and premium credit factors outlined for each type. The effective date requested for these changes is 02/28/2025. The company has also provided supporting documents, correspondence with the Department of Insurance, and explanations for the rate changes. Additionally, the filing includes information on the companies involved, project details, contact information, and compliance with state-specific fee requirements.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "IA_AMSI-134274777": {
        "serff_tr_num": "AMSI-134274777",
        "filing_type": "Rate/Rule",
        "date_submitted": "10/10/2024",
        "effective_date_requested_new": "11/13/2024",
        "effective_date_requested_renewal": "11/13/2024",
        "serff_status": "Closed-Approved",
        "filing_description": "American Strategic Insurance Corp. (ASIC) respectfully submits for your review a revision to our Homeowners program.\nPlease refer to Explanatory Memorandum and attached exhibits for further details.\nIf you have any questions or comments, please do not hesitate to contact me at 440-459-6293 or via email at\nHakeem_B_Yusuff@Progressive.com\nSincerely,\nHakeem Yusuff\nProduct Manager, State of Iowa",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 155,
        "company_codes": [
            10872
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "The rate filing is a submission made by American Strategic Insurance Corp (ASIC) for their Iowa Homeowners program. The filing includes revisions to their Homeowners program, specifically related to rates and rules within the homeowners insurance product. The filing was submitted on 10/10/2024 and approved with an effective date of 11/13/2024.\n\nKey details of the rate filing include:\n- Filing Type: Rate/Rule\n- Product Name: IA Homeowners\n- State: Iowa\n- Tracks the SERFF number: AMSI-134274777\n- Tracks state-related, company-related tracking numbers (IA.HO3.2024.Q3)\n- Primary Authors: Michael Heinz, Hakeem Yusuff, Cristin Weaver-Nason\n- Reviewer(s): Travis Grassel (primary), Wayne Lacher\n- Filtering Company: American Strategic Insurance Corp\n\nThe filing involved modifications to rate-related documents such as the Rate Order of Calculation (ROC) and the HOH Rule Manual. The rate filing was part of the American Strategic Insurance Corp's efforts to update their homeowners insurance program for the State of Iowa, leading to the removal of rate capping rules and related documents from their program materials.\n\nFurthermore, the rate filing included a breakdown of how premiums are calculated, specific criteria and factors that affect the premium calculation, fees associated with the filing, and details on the minimum earned premium and rounding off premium amounts. Additionally, the rate filing outlines measures for rate increases and",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "IL_HART-134383807": {
        "serff_tr_num": "HART-134383807",
        "filing_type": "Rule",
        "date_submitted": "01/22/2025",
        "effective_date_requested_new": "",
        "effective_date_requested_renewal": "08/30/2025",
        "serff_status": "Closed-Filed",
        "filing_description": "The purpose of this filing is to consolidate home products into our newest home rate plan via an Affiliate Transfer process.\nAgency Rate Plans written in Sentinel Insurance Company will be consolidated into Hartford Accident and Indemnity\nCompany.\nPolicyholders may experience a change because some coverage options and limits offered in the older products are not\navailable in the newest home product.  Where coverage options and limits have been eliminated, policyholders will be moved\ninto the closest match available where possible.  Policyholders can always contact us to discuss their coverage options and\nlimits.\nThe transfer will take place at renewal (no interruption in coverage) and will begin with renewals effective August 30, 2025 and\nlast one year.  We will communicate with the policyholders by sending a notice of transfer that complies with 215 ILCS\n5/143.11b at least 60 days prior to the transfer.  This communication will advise policyholders that they can contact us to\ndiscuss their coverage options and limits.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 91,
        "company_codes": [
            11000,
            22357
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "Based on the filing information provided, it appears that the insurance company, Sentinel Insurance Company, Ltd., in collaboration with Hartford Accident and Indemnity Company, is undergoing a transfer process for Homeowners Insurance policies in Illinois. The filing involves consolidating home products into a new home rate plan through an Affiliate Transfer process.\n\nKey points regarding the rate filing include:\n\n1. **Purpose**: The filing aims to transfer Agency Rate Plans from Sentinel Insurance Company to Hartford Accident and Indemnity Company. This consolidation process is designed to provide enhanced features and benefits to policyholders.\n\n2. **Policyholder Impact**: Policyholders may experience changes in coverage options and limits as some features offered in older products may not be available in the new home product. Policyholders will be transitioned to the closest match available where possible.\n\n3. **Transition Process**: The transfer will occur seamlessly at renewal, with no interruption in coverage. It is scheduled to begin with policy renewals effective August 30, 2025, and will last for one year. Policyholders will be notified in advance through a transfer notice as required by regulatory standards.\n\n4. **Communication**: The insurance company plans to communicate with policyholders to discuss their coverage options and limits, ensuring they are informed and can address any queries they may have.\n\n5. **Company Contacts**: The filing was prepared by Deveroux Myers, Assistant Director of Product Management, and Lisa Curra, Pricing Analyst, with designated contact information provided for further inquiries.\n\nOverall,",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "IL_LEMO-134419957": {
        "serff_tr_num": "LEMO-134419957",
        "filing_type": "Rule",
        "date_submitted": "02/19/2025",
        "effective_date_requested_new": "03/18/2025",
        "effective_date_requested_renewal": "05/17/2025",
        "serff_status": "Closed-Filed",
        "filing_description": "Lemonade submits this Benefits Endorsement rule filing effective March 18, 2025 on new business and May 17, 2025 on\nrenewal.\nWe look forward to your review.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 5032,
        "company_codes": [
            16023
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "Based on the information provided in the filing, Lemonade Insurance Company submitted a Benefits Endorsement rule filing for their Homeowners insurance product in the state of Illinois. The filing was submitted on 02/19/2025 and the effective date requested is 03/18/2025 for new business and 05/17/2025 for renewals.\n\nThe Benefits Endorsement introduces rule changes aimed at enhancing the safety, value, usability, and protection of the insured's assets by providing various benefits such as subscriptions, goods, services, devices, or other rewards. The rule filing includes the addition of Rule 32 - Benefits Endorsement to the Homeowners insurance program. Additionally, Lemonade Insurance Company included supporting documents such as an Explanatory Memorandum and a detailed Manual outlining the rules and coverage details associated with the Benefits Endorsement.\n\nThe filing process was completed with a disposition date of 02/24/2025, where the filing status was marked as \"Filed.\" The filing qualifies for public access, and the rate/rule schedules have been updated to reflect the changes made in the filing. Lemonade Insurance Company looks forward to the review and implementation of the Benefits Endorsement rule changes in their Homeowners insurance program in Illinois.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "KS_GMMX-134433936": {
        "serff_tr_num": "GMMX-134433936",
        "filing_type": "Form",
        "date_submitted": "02/25/2025",
        "effective_date_requested_new": "04/14/2025",
        "effective_date_requested_renewal": "05/21/2025",
        "serff_status": "Closed-Approved and Filed",
        "filing_description": "Encompass Indemnity Company is submitting for your approval a new supplemental application for our C360 program.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 8,
        "company_codes": [
            15130
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "Based on the filing information provided, Encompass Indemnity Company submitted a new supplemental application under the name \"KS EIC C360_Form Filing\" for their Custom360 Property program to the Kansas Department of Insurance. The filing included various forms and supporting documents, such as the Custom360 Property Supplemental Application (A15816KS), Explanatory Memo - Forms, and Forms List Template. The effective dates requested for the new supplemental application were 04/14/2025 for new business and 05/21/2025 for renewals. The filing was designated for the homeowners insurance line of business, specifically targeting owner-occupied homeowners.\n\nThe submission was given a disposition of \"Approved and Filed\" by Josh Carlson on 03/03/2025, and the status was confirmed as closed and approved in SERFF. The filing included a detailed list of forms and endorsements associated with the Custom360 program, outlining optional and mandatory elements for different coverage types in various situations, such as for primary residences, condos, renters, and premier clients.\n\nIn summary, Encompass Indemnity Company's rate filing for the KS EIC C360_Form Filing supplemental application for homeowners insurance in Kansas was successfully approved and is set to be effective from 04/14/2025 for new policies and 05/21/2025 for renewals.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "KS_LBPM-134379791": {
        "serff_tr_num": "LBPM-134379791",
        "filing_type": "Rate",
        "date_submitted": "01/16/2025",
        "effective_date_requested_new": "",
        "effective_date_requested_renewal": "04/26/2025",
        "serff_status": "Closed-Filed",
        "filing_description": "Safeco Insurance Company of America is requesting approval to revise its rates and rules for Homeowners effective April 26,\n2025, for renewal business.  Proposed changes are as follows:\n-Base Unities for Home\n-Base Unities for Condo\n-Roof Age Factors for Home\n-Rate Stabilization Factors for Condo\nThis filing has a 0.0% overall uncapped impact.\nWe appreciate your review of this filing and look forward to your acknowledgement.  Please feel free to contact us with any\nquestions or concerns.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 111,
        "company_codes": [
            24740
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "The rate filing from Safeco Insurance Company of America pertains to the Kansas homeowners insurance segment. The filing proposes revisions to rates and rules that would be effective on April 26, 2025, specifically for renewal business. The key changes outlined in the filing include adjustments to base rates for homes and condos, new roof age factors for homes, and rate stabilization factors for condos. Overall, the filing indicates a 0.0% overall uncapped impact.\n\nThe narrative in the filing elaborates on the detailed analysis undertaken by Safeco Insurance to arrive at the proposed rate revisions. It includes a review of past and prospective loss experience within and outside the state, consideration of catastrophe hazards, insurer operating expenses, and the rationale behind the selected profit margin. Additionally, the filing certifies compliance with the requirements of the Kansas Insurance Department.\n\nFurthermore, the rate filing discloses the impact on customers, with an average uncapped decrease of -0.2% for existing home customers and an average uncapped increase of +23.7% for existing condo customers. The filing also includes a certification by an Associate of the Casualty Actuarial Society, Laura Nees, attesting to the adequacy and non-discriminatory nature of the proposed rates.\n\nIn summary, the rate filing seeks approval for rate revisions in the homeowners segment in Kansas effective April 26, 2025, with a focus on renewal business and adjustments to base rates, roof age factors, and rate stabilization factors.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "KS_LBPM-134409706": {
        "serff_tr_num": "LBPM-134409706",
        "filing_type": "Form",
        "date_submitted": "02/11/2025",
        "effective_date_requested_new": "",
        "effective_date_requested_renewal": "06/23/2025",
        "serff_status": "Closed-Approved and Filed",
        "filing_description": "In accordance with Kansas’ filing provision, we respectfully submit the following revisions for our Homeowners program.\nThe information below provides a list of forms submitted with this filing.  In addition, it also provides a summary of the major\ncoverage or policies differences from our currently approved homeowner policy.\nOur company would like to have the option of reformatting text or moving boxes, where applicable, to accommodate marketing\nrequirements and printing of forms. The format of the forms may vary depending on the needs of our clients (e.g. paper size,\nelectronic distribution, etc.). The language will remain the same as approved by your Division and any font requirements will be\nmaintained.\nWe appreciate your review of this filing. Should you have any questions or concerns, please do not hesitate to contact me\ndirectly.\nThis form will be used for renewal business only as we no longer write new business in these companies.\nThe following provides a summary for each form submitted with this filing.\n•New Form: FMHO 1182 01 25/Replaced Form: FMHO 1182\n•New Form: FMHO 547 01 25/Replaced Form: FMHO 547 05 91\n•New Form: FMHO 1199 01 25/Replaced Form: FMHO 1199\n  o  Additions:\n    -    Matching of siding, “roof surfacing” or windows excluded\n  o  Modifications:\n    -    We also took this opportunity to update the old forms to follow our standards of placing defined terms in quotation marks\nand bolding section titles.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 111,
        "company_codes": [
            42404,
            23035,
            33600
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "The rate filing mentioned in the provided information pertains to Homeowners insurance products offered by Liberty Insurance Corporation, Liberty Mutual Fire Insurance Company, and LM Insurance Corporation in the state of Kansas. The filing included three new endorsements: Expanded Replacement Cost Endorsement (FMHO 1182), Optional Loss Settlement Endorsement (FMHO 547), and Homeprotector Plus Endorsement (FMHO 1199).\n\nSome key points related to the rate filing include:\n- The Effective Date requested for the new endorsements is set for June 23, 2025.\n- The companies involved in the filing are part of the Liberty Mutual Group of insurance companies.\n- The state of Kansas is the regulatory jurisdiction for this filing.\n- The rate filing seeks to introduce revisions and updates to the Homeowners program in accordance with Kansas filing provisions.\n- The filing includes the addition of coverage provisions related to Replacement Cost, Loss Settlement, and Increased Special Limits for certain personal property items.\n- The filing was submitted and approved, with a disposition date of February 26, 2025.\n- The forms included in the filing were for renewal business only, as the companies no longer write new business for these forms.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "KY_ALSE-134398573": {
        "serff_tr_num": "ALSE-134398573",
        "filing_type": "Rule",
        "date_submitted": "01/31/2025",
        "effective_date_requested_new": "04/21/2025",
        "effective_date_requested_renewal": "07/05/2025",
        "serff_status": "Closed-Acknowledged",
        "filing_description": "With this filing, Allstate is proposing changes to the Installment Fees for the Allstate Insurance Company (AIC) Mobilehome\n(MBH) program in the state of Kentucky.\nFurther information regarding these changes can be found in the enclosed attachments.\nThis change will apply to new business written on or after 4/21/2025 and for renewals effective on or after 7/5/2025.\nThis filing company is closed to new business. Allstate has, however, supplied a new business effective date for special\nbusiness cases. For example, to accommodate a new business policy in the same company to a policyholder that has been\nreinstated, or if a cancel/re-write is necessary.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 8,
        "company_codes": [
            19232
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "The rate filing is a proposal by Allstate Insurance Company to increase the installment fees for its AIC Mobilehome program in the state of Kentucky. The changes involve adjusting the installment fees for different payment methods, specifically increasing fees for electronic fund transfers and other payment methods, excluding payroll deductions. The effective date for new business is requested to be 04/21/2025 and for renewals is requested to be 07/05/2025. The filing status is acknowledged, and the SERFF tracking number is ALSE-134398573. The filing includes various attachments such as the revised manual pages, explanatory memorandum, and summary of manual changes. The filing also notes that the company is closed to new business but allows exceptions for special cases.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "KY_ALSE-134398945": {
        "serff_tr_num": "ALSE-134398945",
        "filing_type": "Rule",
        "date_submitted": "01/31/2025",
        "effective_date_requested_new": "04/21/2025",
        "effective_date_requested_renewal": "07/05/2025",
        "serff_status": "Closed-Acknowledged",
        "filing_description": "With this filing, Allstate is proposing changes to the Installment Fees for the Allstate Property and Casualty Insurance\nCompany (APC) Homeowners – Owner Occupied Homeowners (HO) program in the state of Kentucky.\nFurther information regarding these changes can be found in the enclosed attachments.\nThis change will apply to new business written on or after 4/21/2025 and for renewals effective on or after 7/5/2025.\nThis filing company is closed to new business. Allstate has, however, supplied a new business effective date for special\nbusiness cases. For example, to accommodate a new business policy in the same company to a policyholder that has been\nreinstated, or if a cancel/re-write is necessary.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 8,
        "company_codes": [
            17230
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "The rate filing submitted by Allstate Property and Casualty Insurance Company in Kentucky proposes changes to the installment fees for their Homeowners - Owner Occupied Homeowners program. The changes include increasing installment fees for electronic fund transfers and other payment methods, while maintaining no fees for Allstate Payroll Deductions. The effective date for these changes for new business is requested as 04/21/2025 and for renewals as 07/05/2025. The filing status is acknowledged, and the disposition was received on 02/25/2025. The filing includes updated manual pages and supporting documents, such as an Actuarial Memorandum and a Tracked Version of the Manual. The filing also indicates the submitted fee amount of $5.00 and lists the company contact information for any inquiries.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "KY_USAA-134421819": {
        "serff_tr_num": "USAA-134421819",
        "filing_type": "Form",
        "date_submitted": "02/19/2025",
        "effective_date_requested_new": "10/27/2025",
        "effective_date_requested_renewal": "10/27/2025",
        "serff_status": "Closed-Approved",
        "filing_description": "USAA is introducing the Insurance Institute for Business & Home Safety (IBHS) Special Roof Endorsement, form number HO-\nIBHS. This endorsement provides up to $20,000 for policyholders to replace their roofs with an IBHS Fortified Roof in case of a\nroof replacement event.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 200,
        "company_codes": [
            21253,
            25941,
            25968,
            18600
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "In the rate filing for the insurance product \"Homeowners\" by Garrison Property and Casualty Insurance Company and related companies, the Special Roof Coverage endorsement (HO-IBHS) was introduced to provide up to $20,000 for policyholders to replace their roofs with an IBHS Fortified Roof in case of a roof replacement event. The filing was submitted on 02/19/2025 in Kentucky and was approved with an effective date requested for 10/27/2025. The filing included an overall rate impact of 0.000% on written premiums, indicating no change in rates for policyholders. Additionally, the filing incurred a state fee of $20.00, split equally among the four company entities involved in the filing.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "LA_LBPM-134284450": {
        "serff_tr_num": "LBPM-134284450",
        "filing_type": "Rule",
        "date_submitted": "10/15/2024",
        "effective_date_requested_new": "11/16/2024",
        "effective_date_requested_renewal": "",
        "serff_status": "Closed-Meets Requirements",
        "filing_description": "In reference to recently approved filing LBPM-134260451, we noticed a clerical error in our filing that we would like to amend.\nPlease see attached an updated copy of page 18 (Loss Settlement Type) that corrects an erroneous reference to “greater\nthan” in the Replacement Cost section. This has been updated to correctly reflect the “less than or equal to” condition that has\nalways applied to Replacement Cost.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 111,
        "company_codes": [
            24740
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "Based on the filing with the Department of Insurance (DOI) from Safeco Insurance Company of America, the company has made amendments to its Homeowners insurance product in Louisiana. The filing includes updated documents related to rates, rules, compliance, and operational procedures. Here are some key points from the filing:\n\n1. **Effective Date:** The effective date for the amended Homeowners product is requested to be November 16, 2024.\n  \n2. **Compliance:** The Louisiana Department of Insurance reviewed and acknowledged the filing, confirming that it meets statutory and regulatory requirements.\n\n3. **Attachments:** Various documents were attached to the filing, including Last Action Letters, Manual Pages, Rule Rates, and Statements of Compliance.\n\n4. **Policy Details:** The filing includes detailed information on Loss Settlement Types, Roof Settlement Types, Replacement Cost options, and specific conditions for coverage, such as for windstorm or hail damage.\n\n5. **Schedule Items:** The filing includes Supporting Document Schedules, such as Last Action Letters, Statements of Compliance, and Manual Pages, all in compliance with regulatory guidelines.\n\n6. **Correspondence:** The filing includes objection letters, response letters, and notes to filers indicating the interaction and communication between Safeco Insurance and the Louisiana Department of Insurance.\n\n7. **License and Registration:** Safeco Insurance Company of America is licensed in Louisiana and operates as a Property & Casualty insurance provider.\n\nThis summary of the filing provides an overview of the changes made by Safeco Insurance in its",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "MI_ALSE-134422885": {
        "serff_tr_num": "ALSE-134422885",
        "filing_type": "Rate",
        "date_submitted": "02/18/2025",
        "effective_date_requested_new": "03/31/2025",
        "effective_date_requested_renewal": "05/15/2025",
        "serff_status": "Closed-Filed",
        "filing_description": "With this filing, Allstate is proposing an overall 2.2% rate level change to the Allstate Indemnity Company (AI) Homeowners -\nManufactured Home (MFH) program in the state of Michigan.\nThe overall rate level change has been achieved through revision of the Rate Adjustment Factor. Further information regarding\nthese changes can be found in the enclosed attachments.\nThis change will apply to new business written on or after March 31, 2025 and for renewals effective on or after May 15, 2025.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 8,
        "company_codes": [
            19240
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "Based on the information provided in the filing from Allstate Indemnity Company for the Michigan Manufactured Homeowners Insurance program, the rate change proposal involves an overall 2.2% increase to the rates. This rate level change is achieved through the revision of the Rate Adjustment Factor. The effective date for this rate change is requested to be March 31, 2025, for new business written on or after this date and for renewals effective on or after May 15, 2025.\n\nThe filing includes various supporting documents such as actuarial or explanatory memorandums, actuarial support/exhibits, policyholder impact documentation, and information about impacts to policyholders. The filing was submitted on February 18, 2025, and the disposition status is listed as Filed with a disposition date of March 3, 2025. The primary author of the filing is Jennifer Olson, and the reviewer is Mandi Whinnie.\n\nFor further details on specific rule changes, factors, and other relevant information, it would be necessary to review the detailed contents of the attachments and filings provided by Allstate Indemnity Company as part of this rate change proposal.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "MI_ALSE-134443416": {
        "serff_tr_num": "ALSE-134443416",
        "filing_type": "Rate/Rule",
        "date_submitted": "03/03/2025",
        "effective_date_requested_new": "07/01/2025",
        "effective_date_requested_renewal": "",
        "serff_status": "Submitted to State",
        "filing_description": "This filing details the introduction of the Allstate North American Insurance Company (ANAIC) Homeowners program in the\nstate of Michigan.\nFurther information can be found in the enclosed attachments.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 8,
        "company_codes": [
            11110
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "This filing details the introduction of the Allstate North American Insurance Company (ANAIC) Homeowners program in the state of Michigan. The product name is ANAIC HO, and the filing company is Allstate North American Insurance Company. The TOI/Sub-TOI is 04.0 Homeowners/04.0003 Owner Occupied Homeowners.\n\nKey Information:\n- Filing Type: Rate/Rule\n- Date Submitted: 03/03/2025\n- Effective Date Requested (New): 07/01/2025\n- Filing Company: Allstate North American Insurance Company\n- Product Name: ANAIC HO\n- Project Name/Number: Introduction of ANAIC Homeowners/RITM06473713\n\nRate Information:\n- Rate data applies to filing method: File and Wait\n- Overall Percentage of Last Rate Revision: % (not disclosed)\n- Company Name: Allstate North American Insurance Company\n- Overall % Indicated Change: %\n- Overall % Rate Impact: %\n- Written Premium Change for this Program: %\n- Number of Policyholders Affected for this Program: Not disclosed\n- Written Premium for this Program: Not disclosed\n- Maximum % Change: (where required): Not disclosed\n- Minimum % Change (where required): Not disclosed\n\nRate/Rule Schedule:\n1. Rule Manual - Entire Manual - New\n   Document: 11. MI HO ANAIC R57738 Rules Manual.pdf\n2. Rate Manual",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "MI_LBPM-134437577": {
        "serff_tr_num": "LBPM-134437577",
        "filing_type": "Form",
        "date_submitted": "02/27/2025",
        "effective_date_requested_new": "06/23/2025",
        "effective_date_requested_renewal": "07/28/2025",
        "serff_status": "Submitted to State",
        "filing_description": "In accordance with Michigan’s filing provision, we respectfully submit the following revisions for our Legacy, Elements, and\nSimple Renters program.\nThe table below provides a list of form(s) submitted with this filing.  In addition, it also provides a summary of the major\ncoverage or policies differences from our currently approved Homeowners, Condo, Renters, and Simple Renters policies.\nOur company would like to have the option of reformatting text or moving boxes, where applicable, to accommodate marketing\nrequirements and printing of forms. The format of the forms may vary depending on the needs of our clients (e.g. paper size,\nelectronic distribution, etc.). The language will remain the same as approved by your Division and any font requirements will be\nmaintained. Please note each form provided with this filing includes a bracketed placeholder [LOGO] for our Liberty Mutual\nlogo and a bracketed placeholder [Company Name] for our underwriting company.\nWe appreciate your review of this filing. Should you have any questions or concerns, please do not hesitate to contact me\ndirectly.\nPOLICY FORMS AND ENDORSEMENTS\nFORM NUMBER: FMHO 3047 10 24\nREPLACED FORM: FMHO 3047 05 16\nFORM TITLE/Updates : POLICY DECLARATIONS - Adding variable text clarifying the policy period on the Declarations Page.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 111,
        "company_codes": [
            42404,
            23035,
            23043,
            33600,
            12484
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "The rate filing pertains to a property and casualty insurance company, specifically Liberty Mutual, for their Homeowners insurance product in the state of Michigan. The filing includes revisions for their Legacy, Elements, and Simple Renters program. The key changes include updates to the Policy Declarations form (FMHO 3047) by adding variable text to clarify the policy period on the Declarations Page. The filing also allows for flexibility in reformatting text or moving boxes to accommodate marketing requirements, while maintaining approved language and font requirements. The effective date requested for the new policy is 06/23/2025, and for renewal is 07/28/2025. The filing was submitted on 02/27/2025 and is currently in a 'Submitted to State' status via SERFF Tracking #: LBPM-134437577. The company behind the filing is Liberty Insurance Corporation, part of the Liberty Mutual Group.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "MI_LBPM-134437587": {
        "serff_tr_num": "LBPM-134437587",
        "filing_type": "Form",
        "date_submitted": "02/27/2025",
        "effective_date_requested_new": "06/23/2025",
        "effective_date_requested_renewal": "07/28/2025",
        "serff_status": "Submitted to State",
        "filing_description": "In accordance with Michigan’s filing provision, we respectfully submit the following revisions for our Simple Renters program.\nThe table below provides a list of form(s) submitted with this filing.  In addition, it also provides a summary of the major\ncoverage or policies differences from our currently approved Simple Renters policy.\nOur company would like to have the option of reformatting text or moving boxes, where applicable, to accommodate marketing\nrequirements and printing of forms. The format of the forms may vary depending on the needs of our clients (e.g. paper size,\nelectronic distribution, etc.). The language will remain the same as approved by your Division and any font requirements will be\nmaintained. Please note each form provided with this filing includes a bracketed placeholder [LOGO] for our Liberty Mutual\nlogo and a bracketed placeholder <Company Name> for our underwriting company.\nWe appreciate your review of this filing. Should you have any questions or concerns, please do not hesitate to contact us\ndirectly.\nPOLICY FORMS AND ENDORSEMENTS\nFORM NUMBER: LMHO 2100MI 03 25\nREPLACED FORM: LMHO 2100MI 03 19\nFORM TITLE/Updates: SPECIAL PROVISIONS – MICHIGAN\n•The policy period provision under Sections I and Section II – Conditions has been updated, now referring to the Declarations\nPage for the effective time of the policy.\n•Applies to:\n  o  Liberty Mutual Insurance Company\n  o  Liberty Mutual Personal Insurance Company\n•Prior SERFF Tracking# LBPM-131808396 (for the forms this endorsement is amending)",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 111,
        "company_codes": [
            23043,
            12484
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "The rate filing submitted by Liberty Mutual Insurance Company for their Simple Renters program in Michigan includes revisions to the policy forms and endorsements. The amendments mainly focus on updating the policy period provision under Sections I and II – Conditions to refer to the Declarations Page for the effective time of the policy. The changes apply to both Liberty Mutual Insurance Company and Liberty Mutual Personal Insurance Company. The filing also includes new definitions related to policy holders, modifications to the duties after a loss, cancellation terms, appraisals, and other policy conditions for property and liability coverages.\n\nOverall, the rate filing seeks to enhance and clarify policy provisions while addressing requirements specific to Michigan regulations. It is aimed at improving the customer experience and ensuring compliance with state guidelines.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "MN_ALSE-134409609": {
        "serff_tr_num": "ALSE-134409609",
        "filing_type": "Rate",
        "date_submitted": "02/07/2025",
        "effective_date_requested_new": "02/17/2025",
        "effective_date_requested_renewal": "04/03/2025",
        "serff_status": "Closed-Rates and/or Rules Accepted (10)",
        "filing_description": "With this filing, Allstate is proposing an overall 1.8% rate level change to the Allstate Insurance Company (AIC) Homeowners -\nOwner Occupied Homeowners (HO) program in the state of Minnesota.\nAllstate is proposing revisions to the following rating plans: Max Deductible Credits. The overall rate level change has been\nachieved through revision of the Rate Adjustment Factors. Further information regarding these changes can be found in the\nenclosed attachments.\nThis change will apply to new business written on or after 2/17/2025 and for renewals effective on or after 4/3/2025.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 8,
        "company_codes": [
            19232
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "Based on the information provided in the filing, it appears that Allstate Insurance Company has submitted a rate change (1.8%) for its Allstate Insurance Company (AIC) Homeowners - Owner Occupied Homeowners (HO) program in the state of Minnesota. Here are the key details:\n\n1. **Rate Change:** Allstate is proposing an overall 1.8% rate level change to the AIC Homeowners program in Minnesota.\n2. **Effective Dates:** The rate change will apply to new business written on or after 02/17/2025 and for renewals effective on or after 04/03/2025.\n3. **Filing Type:** Rate filing\n4. **Company Contact:** Adriana Cahue is the contact person for this filing, with contact details provided.\n5. **Product Information:** TOI/Sub-TOI: 04.0 Homeowners/04.0003 Owner Occupied Homeowners, Product Name: AIC HO\n6. **Filing Fees:** A fee of $125.00 was required for this filing and was processed on 02/07/2025.\n\nAdditionally, the filing includes details on the reinsurance program, the methodology used for adjustments to premiums, explanations of various terms such as multi-year contracts, per occurrence agreements, and aggregate excess contracts related to reinsurance arrangements.\n\nIf you need more specific details or analysis on any particular aspect of this filing or require further information, feel free to ask",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "MN_ALSE-134409640": {
        "serff_tr_num": "ALSE-134409640",
        "filing_type": "Rate",
        "date_submitted": "02/10/2025",
        "effective_date_requested_new": "02/17/2025",
        "effective_date_requested_renewal": "04/03/2025",
        "serff_status": "Closed-Rates and/or Rules Accepted (10)",
        "filing_description": "With this filing, Allstate is proposing an overall 1.9% rate level change to the Allstate Vehicle and Property Insurance Company\n(AVPIC) Homeowners - Owner Occupied Homeowners (HO) program in the state of Minnesota.\nAllstate is proposing revisions to the following rating plans: Rate Adjustment Factors, Fixed Expense Base Premium and\nAdditive Fixed Expense Amount. The overall rate level change has been achieved through revision of the Rate Level Factors.\nFurther information regarding these changes can be found in the enclosed attachments.\nThis change will apply to new business written on or after 2/17/2025 and for renewals effective on or after 4/3/2025.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 8,
        "company_codes": [
            37907
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "In summary, the rate filing by Allstate Vehicle and Property Insurance Company in Minnesota proposes an overall 1.9% rate level change to the AVPIC HO program for Owner Occupied Homeowners. The filing includes revisions to rating plans such as Rate Adjustment Factors, Fixed Expense Base Premium, and Additive Fixed Expense Amount, achieved through the modification of Rate Level Factors. The rate change will apply to new business written on or after 2/17/2025 and for renewals effective on or after 4/3/2025.\n\nKey details of the filing include:\n- Company: Allstate Vehicle and Property Insurance Company\n- Product Name: AVPIC HO\n- State: Minnesota\n- Type of Insurance: Homeowners\n- Filing Type: Rate Change\n- Date Submitted: 02/10/2025\n- Effective Date Requested: 02/17/2025 for new business and 04/03/2025 for renewals\n- Rate Change: 1.9%\n- Contact Person: Adriana Cahue\n- Contact Information: acahu@allstate.com, 847-402-7877\n\nThe filing includes various attachments such as P & C Actuarial Memorandum and Data, Filing Certification Forms, Price Optimization Attestation, and Side-by-Sides. The filing fees include a required fee of $125.00, which was paid by Allstate Vehicle and Property Insurance Company on 02/10/202",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "MN_AMSI-134380414": {
        "serff_tr_num": "AMSI-134380414",
        "filing_type": "Rate/Rule",
        "date_submitted": "02/12/2025",
        "effective_date_requested_new": "02/12/2025",
        "effective_date_requested_renewal": "",
        "serff_status": "Closed-60A.315 - EXPEDITED",
        "filing_description": "American Strategic Insurance Corp. (ASIC) respectfully submits for your review, under the file and use provision, a revision to\nour condominium (HOU) program.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 155,
        "company_codes": [
            10872
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "In summary, the rate filing for the Minnesota Condominium Unit-Owners Program by American Strategic Insurance Corp. includes the following key points:\n\n1. **Rate Increase:** The filing proposes an overall +25% rate increase through increases to base rates for the condominium program.\n\n2. **Loss Assessment Changes:** The filing includes the removal of the $25,000 and $50,000 Loss Assessment options, converting existing policies to a $10,000 limit at renewal.\n\n3. **Underwriting Updates:** The filing removes underwriting eligibility guidelines from the previously filed manuals, though guidelines will still be available to agents via the Agent Manual.\n\n4. **Insurance Scoring:** There are no changes to the insurance score model or its use in underwriting condo policies.\n\n5. **Effective Date:** The proposed rate changes and coverage adjustments are effective from February 12, 2025, under the expedited filing provision.\n\n6. **General Rules Updates:** The filing includes updates to general underwriting eligibility, occupancy/use criteria, applicant requirements, property location standards, and property characteristics.\n\nOverall, the filing aims to adjust rates, coverage limits, and loss assessment options in response to updated risk assessments and market conditions for the condominium program in Minnesota.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "MN_TRVD-G134202060": {
        "serff_tr_num": "TRVD-G134202060",
        "filing_type": "Rate",
        "date_submitted": "08/08/2024",
        "effective_date_requested_new": "02/07/2025",
        "effective_date_requested_renewal": "04/15/2025",
        "serff_status": "Closed-Rates and/or Rules Accepted (10)",
        "filing_description": "With this filing we are amending our Quantum Homeowners 2.0 product as described in the accompanying documentation.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 3548,
        "company_codes": [
            38130
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "The rate filing pertains to Travelers Personal Insurance Company's product, Quantum Home 2.0, specifically related to homeowners insurance in Minnesota. The filing was submitted on August 8, 2024, with a submission type of rate. The effective dates requested for the new policies are 02/07/2025 and for renewals are 04/15/2025. The filing was ultimately accepted by the state on 01/31/2025.\n\nThe filing involved several individuals in various roles such as authors and reviewers. The disposition of the filing was \"Rates and/or Rules Accepted,\" and the overall rate impact was a 35.5% change with a 47.7% indicated change for Travelers Personal Insurance Company. This change affected 64,085 policyholders with a written premium of $60,252,352.\n\nAdditionally, several supporting documents were part of the filing, including expense details, actuarial data, certification forms, and attestations. The filing included adjustment factors for various aspects such as expenses and amortizations. Requests for extension and objections were also addressed within the filing process.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "MO_LBPM-134358153": {
        "serff_tr_num": "LBPM-134358153",
        "filing_type": "Rate",
        "date_submitted": "12/24/2024",
        "effective_date_requested_new": "02/18/2025",
        "effective_date_requested_renewal": "04/01/2025",
        "serff_status": "Closed-REVIEWED",
        "filing_description": "In accordance with Missouri’s filing provision, American Economy Insurance Company (AEIC) is respectfully submitting\nrevisions to its Homeowners and Condo rating program with a new business effective date of 2/18/2025 and renewal business\neffective date of 4/1/2025.\nSummary of Filing Materials:\n•Home CovE\n•Condo Base Rates\n•Condo CovA Base\n•Condo Loss Assessment Factors\n•Actuarial Justification\nThe revisions contained within this filing result in an impact of -.2% for Home and 15% for Condo. The overall rate impact is\n0%.\nWe appreciate your review of this filing. Should you have any questions or concerns, please do not hesitate to contact us.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 111,
        "company_codes": [
            19690
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "The rate filing submitted by American Economy Insurance Company for their Homeowners and Condo rating program in Missouri included several key components and changes:\n\n1. **Effective Dates:** The new business effective date was requested as 02/18/2025, and the renewal business effective date was requested as 04/01/2025.\n   \n2. **Product Name:** Homeowners\n\n3. **Revisions Included:** \n   - Rate changes for Home Cov E, Condo Base Rates, Condo Cov A Base, Condo Loss Assessment Factors\n   - Actuarial Justification was provided\n   - Overall rate impact was 0%, with a negative impact of -.2% for Home and 15% for Condo.\n\n4. **Company:** American Economy Insurance Company\n   \n5. **Overall % Indicated Change:** 15.6%\n   \n6. **SERFF Tracking Number:** LBPM-134358153\n   \n7. **Filing Type:** Rate\n   \n8. **Disposition:** The filing was reviewed and disposition date was 02/26/2025, with a status of REVIEWED.\n\nThis filing incorporated actuarial justification, rate rule attachments, objection response letters and exhibits, supporting documents like actuarial certification and mocks, and had a detailed breakdown of various factors influencing rates such as loss assessment factors for Condo, loss assessment details, coverage information, and specific territory mapping details. The Company provided detailed response letters addressing objections raised, providing explanations and justifications for",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "MO_LBPM-134364067": {
        "serff_tr_num": "LBPM-134364067",
        "filing_type": "Rate",
        "date_submitted": "12/30/2024",
        "effective_date_requested_new": "02/18/2025",
        "effective_date_requested_renewal": "04/01/2025",
        "serff_status": "Closed-REVIEWED",
        "filing_description": "Safeco respectfully requests to revise its homeowners, renters, and condo products. The proposed revision will be effective for\nrenewal business on and after 4/1/2025 and 2/18/2025 for new business for renters only. The proposed change is listed below:\n•Revised Base Rates (Home)\n•Revised Package Level Unities (Home)\n•Revised Roof Age Factors (Home)\n•Territory Unities (Renter and Condo)\n•Revised Loss Assessment factors (Condo)\nThank you for reviewing our filing. If you have any questions or need any additional information, please contact us.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 111,
        "company_codes": [
            24740
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "The rate filing submitted by Safeco Insurance Company of America for homeowners, renters, and condo products in Missouri includes several proposed revisions effective for renewal business on and after April 1, 2025, and February 18, 2025, for new business for renters only. The proposed changes include:\n- Revised base rates for homeowners\n- Revised package level unities for homeowners\n- Revised roof age factors for homeowners\n- Territory unities for renters and condo\n- Revised loss assessment factors for condo\n\nThe overall indicated change is 15.6%, with a 0.4% rate impact, resulting in a written premium change of $312,060 for 31,070 policyholders affected, with a written premium for this program totaling $84,967,191. The filing includes various rating manuals, actuarial justifications, mock-ups, objection responses, exhibit documents, and supporting materials to justify the rate changes.\n\nThe objection response letter addressed concerns raised by the Department of Insurance regarding the proposed rate increases. Safeco provided detailed responses to questions about policyholder impact, reasons for rate increases, rate adequacy, territory determination, and coverage level determination. The response indicated that necessary justification and explanations were provided to address the concerns raised by the Department.\n\nOverall, the rate filing process involved detailed analysis, documentation, and collaboration with regulatory authorities to ensure compliance with Missouri insurance laws and regulations. The company demonstrated transparency and responsiveness in addressing inquiries and objections throughout the filing process.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "MO_TRVD-G134325887": {
        "serff_tr_num": "TRVD-G134325887",
        "filing_type": "Rate",
        "date_submitted": "11/20/2024",
        "effective_date_requested_new": "11/10/2024",
        "effective_date_requested_renewal": "11/10/2024",
        "serff_status": "Closed-REVIEWED",
        "filing_description": "With this filing, we are placing correct documents on file per request of the Department.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 3548,
        "company_codes": [
            38130
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "Based on the filing information provided for Travelers Personal Insurance Company's Quantum Home 2.0 product in Missouri:\n\n- **Company:** Travelers Personal Insurance Company\n- **Product Name:** Quantum Home 2.0\n- **State:** Missouri\n- **Type of Insurance:** Homeowners\n- **Filing Type:** Rate\n- **Date Submitted:** 11/20/2024\n- **Effective Date Requested:** 11/10/2024\n- **Author(s):** Jaime Jewett, Austin Pruitt, Candice Root\n- **Reviewer(s):** Patrick Lennon\n- **Disposition Date:** 02/27/2025\n- **Disposition Status:** REVIEWED\n- **Rate Change Type:** Neutral\n- **Overall Percentage of Last Rate Revision:** 7.300%\n- **Total Company Rate Impact:** Not specified\n- **Rate Method:** Use & file\n\nAdditionally, the filing includes the rate tables for the various coverage types under Quantum Home 2.0, as well as information on exceptional life events factors. The filing was submitted with the necessary fees and supporting documents, such as actuarial justifications and rate schedules, as per the request of the Department and the corresponding company representative, Patrick Lennon. The filing status was reviewed and closed on 02/27/2025. The closure of the filing does not indicate Department approval but confirms the completion of the review process.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "NC_USAA-134418343": {
        "serff_tr_num": "USAA-134418343",
        "filing_type": "Deviations",
        "date_submitted": "02/14/2025",
        "effective_date_requested_new": "06/01/2025",
        "effective_date_requested_renewal": "06/01/2025",
        "serff_status": "Closed-Approved",
        "filing_description": "United Services Automobile Association (USAA), USAA-Casualty Insurance Company (USAA-CIC), USAA-General Indemnity\nCompany (USAA-GIC), and Garrison Property and Casualty Insurance Company (Garrison) propose revisions to the\nHomeowners Insurance premium rates with an overall effect of 5.1% to be effective 6/1/2025 for new business and renewal\nbusiness.\nWith this filing, we are adopting the North Carolina Rate Bureau Base Premiums in Circular P-25-1. We will also be preserving\nour existing deviations for Windstorm or Hail Exclusion Credits and Wind Mitigation Credits. In addition, we are proposing\nadjustments to the following rating deviations:\n•Revise Territory Deviation Factors – Owners and Condos\nWith this filing, in order to meet the 6/1/2025 effective date, we have an internal deadline of 2/24/2022 to receive regulatory\napproval. We understand the turnaround for this filing is shorter than expected but we are willing to meet with NC DOI at your\nmost convenient date and time, via teleconference, if there are any concerns or questions. This will help allow us to meet our\ntimeline and remain efficient in implementing our filing efforts.\nOur rates will remain equal to or lower than North Carolina Rate Bureau.\nYour approval is appreciated. If you have questions, please call me at (210) 265-7825 or email me at laura.tijerina@usaa.com.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 200,
        "company_codes": [
            25941
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "The rate filing submitted by United Services Automobile Association (USAA) for the North Carolina homeowners insurance market proposes revisions to premium rates with an overall effect of 5.1% for new and renewal businesses, effective 06/01/2025. The filing aims to adopt the North Carolina Rate Bureau Base Premiums in Circular P-25-1 while preserving existing deviations for Windstorm or Hail Exclusion Credits and proposing adjustments to various rating deviations.\n\nThe filing includes deviations related to tier discounts, deductible credits, supplemental coverages, and discounts for factors such as loss history, multi-product, loyalty, and more. The deviation components affect various aspects of the homeowners insurance rating structure, including credit-based insurance scores, military affiliation, non-payment cancellations, and more. These components are designed to provide favorable rates based on specific risk characteristics of the insured.\n\nThe filing received approval from the North Carolina Department of Insurance on 02/21/2025 with the effective date set as 06/01/2025. The filings also include attachments such as deviation questionnaires, explanatory memos, and supporting documents outlining the details and justifications for the proposed deviations.\n\nIn summary, the rate filing by USAA for North Carolina homeowners insurance involves a comprehensive adjustment of premium rates, deviations, and discounts to provide competitive and tailored insurance offerings while maintaining regulatory compliance and market competitiveness.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "NC_USAA-134418345": {
        "serff_tr_num": "USAA-134418345",
        "filing_type": "Deviations",
        "date_submitted": "02/14/2025",
        "effective_date_requested_new": "06/01/2025",
        "effective_date_requested_renewal": "06/01/2025",
        "serff_status": "Closed-Approved",
        "filing_description": "United Services Automobile Association (USAA), USAA-Casualty Insurance Company (USAA-CIC), USAA-General Indemnity\nCompany (USAA-GIC), and Garrison Property and Casualty Insurance Company (Garrison) propose revisions to the\nHomeowners Insurance premium rates with an overall effect of 5.1% to be effective 6/1/2025 for new business and renewal\nbusiness.\nWith this filing, we are adopting the North Carolina Rate Bureau Base Premiums in Circular P-25-1. We will also be preserving\nour existing deviations for Windstorm or Hail Exclusion Credits and Wind Mitigation Credits. In addition, we are proposing\nadjustments to the following rating deviations:\n•Revise Territory Deviation Factors – Owners and Condos\nWith this filing, in order to meet the 6/1/2025 effective date, we have an internal deadline of 2/24/2022 to receive regulatory\napproval. We understand the turnaround for this filing is shorter than expected but we are willing to meet with NC DOI at your\nmost convenient date and time, via teleconference, if there are any concerns or questions. This will help allow us to meet our\ntimeline and remain efficient in implementing our filing efforts.\nOur rates will remain equal to or lower than North Carolina Rate Bureau.\nYour approval is appreciated. If you have questions, please call me at (210) 265-7825 or email me at laura.tijerina@usaa.com.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 200,
        "company_codes": [
            25968
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "The rate filing by USAA Casualty Insurance Company for their North Carolina Homeowners Insurance program proposes revisions to premium rates resulting in an overall 5.1% impact to be effective on June 1, 2025, for both new and renewal business. The filing includes deviations from the North Carolina Rate Bureau Base Premiums and maintains existing deviations for Windstorm or Hail Exclusion Credits and Wind Mitigation Credits. It also proposes adjustments to various rating deviations, such as revising Territory Deviation Factors for Owners and Condos.\n\nThe filing contact for this submission is Laura Tijerina, State Filings Advisor I at USAA, based in San Antonio, Texas. The filing was submitted on February 14, 2025, and was approved by the North Carolina Department of Insurance on February 21, 2025. The document lists various deviation components that impact the premium rates and outlines detailed rules for calculating premium factors based on territory, deductibles, and credits for different scenarios. The effective date of the approved deviations is also indicated as June 1, 2025, in accordance with North Carolina General Statute 58-36-30(a).",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "NC_USAA-134418351": {
        "serff_tr_num": "USAA-134418351",
        "filing_type": "Deviations",
        "date_submitted": "02/14/2025",
        "effective_date_requested_new": "06/01/2025",
        "effective_date_requested_renewal": "06/01/2025",
        "serff_status": "Closed-Approved",
        "filing_description": "United Services Automobile Association (USAA), USAA-Casualty Insurance Company (USAA-CIC), USAA-General Indemnity\nCompany (USAA-GIC), and Garrison Property and Casualty Insurance Company (Garrison) propose revisions to the\nHomeowners Insurance premium rates with an overall effect of 5.1% to be effective 6/1/2025 for new business and renewal\nbusiness.\nWith this filing, we are adopting the North Carolina Rate Bureau Base Premiums in Circular P-25-1. We will also be preserving\nour existing deviations for Windstorm or Hail Exclusion Credits and Wind Mitigation Credits. In addition, we are proposing\nadjustments to the following rating deviations:\n•Revise Territory Deviation Factors – Owners and Condos\nWith this filing, in order to meet the 6/1/2025 effective date, we have an internal deadline of 2/24/2022 to receive regulatory\napproval. We understand the turnaround for this filing is shorter than expected but we are willing to meet with NC DOI at your\nmost convenient date and time, via teleconference, if there are any concerns or questions. This will help allow us to meet our\ntimeline and remain efficient in implementing our filing efforts.\nOur rates will remain equal to or lower than North Carolina Rate Bureau.\nYour approval is appreciated. If you have questions, please call me at (210) 265-7825 or email me at laura.tijerina@usaa.com.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 200,
        "company_codes": [
            18600
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "The rate filing submitted by USAA General Indemnity Company in North Carolina for their NC HO Deviation-GIC product under the homeowners insurance category was approved by the state's Department of Insurance. The filing proposed revisions to the premium rates with an overall effect of 5.1% for new and renewal business, effective from June 1, 2025, maintaining rates equal to or lower than the North Carolina Rate Bureau. The filing included deviations for various rating factors such as territory factors, deductible credits, windstorm or hail exclusion credits, and adjustments to rating deviations.\n\nThe filing was submitted on February 14, 2025, and approved with a disposition date of February 21, 2025. The effective date for the new rates was also confirmed as June 1, 2025. The filing contact was Laura Tijerina, State Filings Advisor I at USAA General Indemnity Company. The supporting documents included a Deviation Questionnaire FC-038, Deviation Pages - GIC, and an Explanatory Memo. The State Tracking # was NC2500070, and the SERFF Tracking # was USAA-134418351.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "NC_USAA-134418355": {
        "serff_tr_num": "USAA-134418355",
        "filing_type": "Deviations",
        "date_submitted": "02/14/2025",
        "effective_date_requested_new": "06/01/2025",
        "effective_date_requested_renewal": "06/01/2025",
        "serff_status": "Closed-Approved",
        "filing_description": "United Services Automobile Association (USAA), USAA-Casualty Insurance Company (USAA-CIC), USAA-General Indemnity\nCompany (USAA-GIC), and Garrison Property and Casualty Insurance Company (Garrison) propose revisions to the\nHomeowners Insurance premium rates with an overall effect of 5.1% to be effective 6/1/2025 for new business and renewal\nbusiness.\nWith this filing, we are adopting the North Carolina Rate Bureau Base Premiums in Circular P-25-1. We will also be preserving\nour existing deviations for Windstorm or Hail Exclusion Credits and Wind Mitigation Credits. In addition, we are proposing\nadjustments to the following rating deviations:\n•Revise Territory Deviation Factors – Owners and Condos\nWith this filing, in order to meet the 6/1/2025 effective date, we have an internal deadline of 2/24/2022 to receive regulatory\napproval. We understand the turnaround for this filing is shorter than expected but we are willing to meet with NC DOI at your\nmost convenient date and time, via teleconference, if there are any concerns or questions. This will help allow us to meet our\ntimeline and remain efficient in implementing our filing efforts.\nOur rates will remain equal to or lower than North Carolina Rate Bureau.\nYour approval is appreciated. If you have questions, please call me at (210) 265-7825 or email me at laura.tijerina@usaa.com.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 200,
        "company_codes": [
            21253
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "The rate filing submitted by Garrison Property and Casualty Insurance Company in North Carolina proposes revisions to the Homeowners Insurance premium rates with an overall effect of 5.1% to be effective from June 1, 2025, for new and renewal business. The filing includes deviations from the North Carolina Rate Bureau Base Premiums in Circular P-25-1, as well as adjustments to various rating deviations such as Territory Deviation Factors, Windstorm or Hail Exclusion Credits, and Wind Mitigation Credits.\n\nThe filing has been approved and closed by the North Carolina Department of Insurance, and the effective date for the new rates is set to be June 1, 2025. The filing contact person is Laura Tijerina, and the supporting documents include the Deviation Questionnaire FC-038, Deviation Pages - GAR, and an Explanatory Memo. The filing includes detailed information on the impact of the aggregate deviation, the credit components, and the certification of the information provided.\n\nOverall, the filing aims to adjust the premium rates for Homeowners Insurance while maintaining compliance with statutory requirements and ensuring fairness and accuracy in the rate adjustments.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "ND_GMMX-134414147": {
        "serff_tr_num": "GMMX-134414147",
        "filing_type": "Form",
        "date_submitted": "02/11/2025",
        "effective_date_requested_new": "03/31/2025",
        "effective_date_requested_renewal": "03/31/2025",
        "serff_status": "Closed-Approved",
        "filing_description": "Encompass Indemnity Company is submitting for your approval a revised application for our C360 program. The new version\nincludes updated Applicant Personal Information section and Producer’s Statement as well as formatting changes.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 8,
        "company_codes": [
            15130
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "Based on the information provided in the filing, here is a summary of the rate filing submitted by Encompass Indemnity Company for their ND_EIC_Condo_Custom 360_Form_03312025 product in North Dakota:\n- Company: Encompass Indemnity Company\n- Product Name: ND_EIC_Condo_Custom 360_Form_03312025\n- State: North Dakota\n- Type of Insurance: Homeowners/Condominium Homeowners (TOI 04.0/04.0001)\n- Filing Type: Form\n- Effective Date Requested: 03/31/2025\n- Filing Status: Approved\n- Filing Fees: $50.00\n- Regulatory Status: Closed - Approved\n- Revisions: Updates to Applicant Personal Information section, Producer’s Statement, and formatting changes.\n\nThe filing included a revised property application (A13142ND Ed. 01012025) to replace the previous version (A13142ND Ed. 12012021), with a focus on enhancing and updating key sections. The effective date requested for the revised form is 03/31/2025, and the filing was successfully approved by the regulatory authorities.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "ND_GMMX-134414190": {
        "serff_tr_num": "GMMX-134414190",
        "filing_type": "Form",
        "date_submitted": "02/11/2025",
        "effective_date_requested_new": "03/31/2025",
        "effective_date_requested_renewal": "03/31/2025",
        "serff_status": "Closed-Approved",
        "filing_description": "Encompass Indemnity Company is submitting for your approval a revised application for our C360 program. The new version\nincludes updated Applicant Personal Information section and Producer’s Statement as well as formatting changes.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 8,
        "company_codes": [
            15130
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "Based on the filing information provided by Encompass Indemnity Company for their ND_EIC_Home_Custom 360_Form_03312025 in North Dakota, the rate filing involved a revised property application A13142ND Ed. 01012025. The new version of the application included updates to the Applicant Personal Information section, Producer’s Statement, and formatting changes. The filing was submitted on 02/11/2025 and had an effective date requested for both new and renewal policies of 03/31/2025.\n\nThe filing was approved and closed by the state on 03/03/2025. The filing fee for this form was $50.00, reflecting Encompass Indemnity Company’s domicile status in Illinois. The application was reviewed by Kimberly Littlejohn and Sarah Juergens, with Sarah Juergens being the primary reviewer. The application included information on prior insurance, mortgagee information, coverage details, deductible amounts, personal property information, and total premium information. The Company requested an effective date of 03/31/2025 for the policies.\n\nOverall, the rate filing involved updates and revisions to the property application form, aiming to enhance the accuracy and completeness of applicant information and statements.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "ND_GMMX-134414199": {
        "serff_tr_num": "GMMX-134414199",
        "filing_type": "Form",
        "date_submitted": "02/11/2025",
        "effective_date_requested_new": "03/31/2025",
        "effective_date_requested_renewal": "03/31/2025",
        "serff_status": "Closed-Approved",
        "filing_description": "Encompass Indemnity Company is submitting for your approval a revised application for our C360 program. The new version\nincludes updated Applicant Personal Information section and Producer’s Statement as well as formatting changes.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 8,
        "company_codes": [
            15130
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "Based on the filing information provided:\n\n- Company: Encompass Indemnity Company\n- Product Name: ND_EIC_Renter_Custom 360_Form_03312025\n- State: North Dakota\n- Type of Insurance: Homeowners (specifically Tenant Homeowners)\n- Filing Type: Form\n- Date Submitted: 02/11/2025\n- Status: Approved\n- Effective Date: 03/31/2025\n- Significant Changes: The revised application for the C360 program includes updated sections for Applicant Personal Information and Producer’s Statement, as well as formatting changes.\n\nThe rate filing was submitted by Encompass Indemnity Company for approval and was subsequently approved with an effective date of 03/31/2025.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "NE_TRVD-G134437855": {
        "serff_tr_num": "TRVD-G134437855",
        "filing_type": "Rule",
        "date_submitted": "02/27/2025",
        "effective_date_requested_new": "03/14/2025",
        "effective_date_requested_renewal": "05/03/2025",
        "serff_status": "Closed-File & Use",
        "filing_description": "With this filing, we are amending our Homeowners programs as detailed in the accompanying Explanatory Memorandum.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 3548,
        "company_codes": [
            19062,
            19070,
            27998,
            25666,
            36137,
            38130
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "Based on the information provided, the rate filing involves revisions to various rules for different coverage packages offered by the insurance company in Nebraska. The filing includes changes to Rule 106: Coverage Packages, Rule 905: Loss Assessment, Rule 511: Loss Assessment Coverage, Rule 535: Enhanced Home Package, Rule 305: High Value Home Coverage, Rule 511: Loss Assessment Coverage, and Rule 530: Additional Coverage Endorsement - ACE. These revisions apply to the Quantum Home 2.0, Quantum Homeowners, and Legacy Homeowners products.\n\nThe rate impact for this filing is indicated as 0.000%, meaning there is no change in the overall percentage rate following these revisions. Additionally, there is no written premium change for this program, and no policyholders are affected by the rate filing.\n\nThe effective date requested for the new changes is 03/14/2025, and for renewal changes, it is 05/03/2025. The filing has been designated as \"File & Use,\" indicating that it is approved for implementation without further review by the regulatory authorities.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "NJ_LBPM-134367579": {
        "serff_tr_num": "LBPM-134367579",
        "filing_type": "Form",
        "date_submitted": "01/06/2025",
        "effective_date_requested_new": "03/15/2025",
        "effective_date_requested_renewal": "04/26/2025",
        "serff_status": "Closed-Approved",
        "filing_description": "In accordance with New Jersey's  filing provision, we are submitting the following revisions to our property lines Renter/Condo\nprograms.\nWe have filed revisions to our Renter/Condo program endorsement\n•Definition of actual cash value.\n•Updating your duties to select and maintain policy limits.\nOur company would like to have the option of reformatting text or moving boxes, where applicable, to accommodate marketing\nrequirements and printing of forms. The format of the forms may vary depending on the needs of our clients (e.g. paper size,\nelectronic distribution, etc.). The language will remain the same as approved by your department and any font requirements\nwill be maintained.\nWe appreciate your review of this filing. Should you have any questions or concerns, please do not hesitate to contact us.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 111,
        "company_codes": [
            24740
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "Based on the information provided in the filing documents, Safeco Insurance Company of America has submitted revisions to their property lines Renter/Condo programs in accordance with New Jersey's filing provision. The revisions include updates to the definition of actual cash value and the duties to select and maintain policy limits.\n\nHere is a summary of the changes made in the filing:\n\n1. **Special Provisions – Fungi, Wet or Dry Rot, Bacteria:** Added coverage for direct physical losses caused by fungi, wet or dry rot, or bacteria, including the cost of removal, testing, and additional living expenses or fair rental value loss.\n   \n2. **Special Provisions – Collapse:** Updated coverage for collapse of the dwelling caused by specific perils, including decay, insect or vermin damage, weight, and use of defective material or methods in construction.\n   \n3. **Special Provisions – Intentional Loss:** Clarification on intentional loss coverage related to acts of domestic abuse, requiring a police report and cooperation with law enforcement.\n   \n4. **Special Provisions – Loss Settlement:** Updated provisions for full value and actual cash value settlements for personal property losses, with conditions for repair or replacement.\n\n5. **Liability Exclusions:** Exclusions for expected or intended acts, violation of criminal law, and participation in organized races or contests involving motorized vehicles.\n\n6. **Controlled Substance Exclusion:** Clarification on coverage exclusion for controlled substances, with exceptions for legitimate prescription drug use.\n\n7. **",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "NM_TRVD-G134428427": {
        "serff_tr_num": "TRVD-G134428427",
        "filing_type": "Rule",
        "date_submitted": "02/24/2025",
        "effective_date_requested_new": "03/14/2025",
        "effective_date_requested_renewal": "05/03/2025",
        "serff_status": "Closed-Approved",
        "filing_description": "With this filing we are amending our Legacy Home, Quantum Home, and Quantum Home 2.0 products as detailed in the\nattached explanatory memorandum.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 3548,
        "company_codes": [
            19062,
            19070,
            27998,
            25666,
            36137,
            38130
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "Based on the provided information, the rate filing involves several insurance products under the Legacy Home, Quantum Home, and Quantum Home 2.0 categories for New Mexico. The filing includes revisions to various rules and coverage packages related to home insurance, including Loss Assessment, Enhanced Home Package, High Value Home Coverage, and Additional Coverage Endorsement - ACE. The filing indicates changes to eligibility requirements, coverage enhancements, limits of liability, and premium calculations across different forms and endorsements. The effective dates for these changes vary, with some applying to new business issued on or after 3/14/2025 and others effective on or after 5/3/2025. The filing has been approved and is set to take effect as per the specified dates, with no rate impact noted in this submission.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "NV_AMSI-134209900": {
        "serff_tr_num": "AMSI-134209900",
        "filing_type": "Rate",
        "date_submitted": "10/01/2024",
        "effective_date_requested_new": "",
        "effective_date_requested_renewal": "",
        "serff_status": "Closed-Withdrawn",
        "filing_description": "American Strategic Insurance Corp. (ASIC) respectfully submits for your review, under the prior approval provision, a revision\nto our HO3  program. Please refer to the Explanatory Memorandum and attached exhibits for further details.\nIf you have any questions or comments, please do not hesitate to contact me at (866)274-8765 ext. 2568 or via email at\nLuis_D_Rodriguez@progressive.com.\nSincerely,\nLuis Rodriguez\nProduct Manager, State of Nevada",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 155,
        "company_codes": [
            10872
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "Based on the information provided in the filing with the Department of Insurance (DOI) from American Strategic Insurance Corp, here is a summary of the rate filing for homeowners insurance in Nevada:\n\n- Company: American Strategic Insurance Corp\n- Product Name: Homeowners\n- State: Nevada\n- Type of Insurance: Homeowners (Owner Occupied)\n- Filing Type: Rate\n- Date Submitted: 10/01/2024\n- Filing Status: Closed-Withdrawn\n- Disposition Date: 02/28/2025\n- Disposition Status: Withdrawn\n- Filing Fees: $25.00 per rate filing\n- Supporting Documents include a Notice Explaining Premium Increases, Credit Scoring Statement, and other relevant exhibits\n- The filing was withdrawn per the company's request and Progressive plans to submit another filing containing the models under a new underwriting company name\n- Details of premium impact based on claims history were provided, including sample tables showing the impact of claims on homeowners' premiums\n- Claim surcharge factors ranging from 1.00 for 0 claims in the past 3 years to 2.50 for 4 claims in the past 3 years\n- Information on underwriting tier assignments based on claim history and personal liability limits\n- The filing included responses to objections and requests for extensions and withdrawals\n\nOverall, the rate filing for homeowners insurance in Nevada by American Strategic Insurance Corp was withdrawn and will be refiled under a new company name",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "NV_HART-134384733": {
        "serff_tr_num": "HART-134384733",
        "filing_type": "Rule",
        "date_submitted": "01/17/2025",
        "effective_date_requested_new": "07/01/2025",
        "effective_date_requested_renewal": "07/01/2025",
        "serff_status": "Closed-Approved",
        "filing_description": "We are filing for your information the introduction of a credit card surcharge to The Hartford’s Home products in the writing\ncompanies referenced above. Policyholders who choose to pay their premium by credit card will incur a credit card surcharge\ncharged and collected by the third-party payment vendor, which will not exceed 3% of the total premium amount.  The\nsurcharge amount will be shown at the time of the transaction and is effective for all transactions processed on or after July 01,\n2025.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 91,
        "company_codes": [
            37478,
            38261,
            30104,
            34690,
            27120,
            22357,
            19682
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "The rate filing by Hartford Insurance Company of the Midwest in Nevada introduces a credit card surcharge to The Hartford's Home products. Policyholders choosing to pay premiums by credit card will incur a surcharge not exceeding 3% of the total premium amount collected by a third-party payment vendor. The surcharge will be displayed at the time of the transaction and take effect from July 01, 2025. The filing includes responses to objections from the regulatory authority regarding the documentation and details of the surcharge, ensuring compliance with the prior-approval authority. Overall, the rate impact for this filing indicates a 0% change in written premium and no policyholders affected.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "NV_HART-134433449": {
        "serff_tr_num": "HART-134433449",
        "filing_type": "Rule",
        "date_submitted": "02/28/2025",
        "effective_date_requested_new": "10/31/2025",
        "effective_date_requested_renewal": "10/31/2025",
        "serff_status": "Assigned",
        "filing_description": "The purpose of this filing is to consolidate home products into our Home Advantage rate plan via an Affiliate Transfer process.\nDirect rate plans written in Hartford Underwriters Insurance Company will be consolidated into Trumbull Insurance Company.\nPolicyholders may experience a change because some coverage options and limits offered in the older products are not\navailable in the Home Advantage product.  Where coverage options and limits have changed, policyholders will be notified in\nwriting in advance of the policy effective date.  Policyholders can always contact us to discuss their coverage options and\nlimits.\nThe transfer will take place at renewal (no interruption in coverage) and will begin with renewals effective October 31, 2025\nand last one year.  We will communicate with the policyholders by sending a notice of transfer that complies with Nev. Rev.\nStat. Ann. § 687B.350 at least 30 days prior to the transfer.  This communication will advise policyholders that they can contact\nus to discuss their coverage options and limits.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 91,
        "company_codes": [
            30104,
            27120
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "Summary of Rate Filing:\n\n- The rate filing involves the consolidation of home products into the Home Advantage rate plan through an Affiliate Transfer process.\n- Hartford Underwriters Insurance Company's direct rate plans will be consolidated into Trumbull Insurance Company.\n- Policyholders may experience changes in coverage options and limits from the older products to the Home Advantage plan.\n- The transfer will occur at renewal with no interruption in coverage beginning on October 31, 2025.\n- Policyholders will be notified in advance of the policy effective date about any changes in coverage options and limits.\n- A notice of transfer will be sent to policyholders at least 30 days prior to the transfer, as required by Nevada state law.\n- The filing was prepared by Stephan Dumont, Director of Product Management, and Kristin Ong, Pricing Analyst.\n- The correspondence includes information about the policy transfer, new policy numbers, coverage effective dates, and potential changes to coverage options and limits.\n- The filing includes details about new features and benefits offered under the Home Advantage policy plan.\n- Policyholders are encouraged to review their renewal policy and contact the company with any questions or to make changes if needed.\n\nOverall, the rate filing aims to provide policyholders with enhanced features and benefits while ensuring a smooth transition to the new policy structure.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "OR_ALSE-134413946": {
        "serff_tr_num": "ALSE-134413946",
        "filing_type": "Rule",
        "date_submitted": "02/13/2025",
        "effective_date_requested_new": "04/21/2025",
        "effective_date_requested_renewal": "06/05/2025",
        "serff_status": "Closed-Filed",
        "filing_description": "With this filing, Allstate is proposing changes to the Installment Fees and Late Payment Fee for the Allstate Insurance\nCompany (AIC) Mobilehome (MBH) program in the state of Oregon.\nFurther information regarding these changes can be found in the enclosed attachments.\nThis change will apply to new business written on or after April 21, 2025 and for renewals effective on or after June 5, 2025.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 8,
        "company_codes": [
            19232
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "In this rate filing, Allstate Insurance Company proposed changes to the Installment Fees and Late Payment Fee for its Allstate Insurance Company Mobilehome program in the state of Oregon. The changes include increasing the Installment Fee for the Allstate Easy Pay Plan, increasing the Installment Fee for all other payment methods (except Allstate Payroll Deductions), and increasing the Late Payment Fee. These changes will apply to new business written on or after April 21, 2025, and for renewals effective on or after June 5, 2025. \n\nThe filing details adjustments to the installment and late payment fees, providing specific information on the revised fee amounts. It also includes supporting documents such as the Explanatory Memorandum explaining the proposed changes, a Certificate of Compliance ensuring regulatory adherence, and a Summary of Manual Changes outlining revisions to the rules manual. The filing was submitted on 02/13/2025, and the effective dates requested are 04/21/2025 for new business and 06/05/2025 for renewals.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "OR_ALSE-134413977": {
        "serff_tr_num": "ALSE-134413977",
        "filing_type": "Rule",
        "date_submitted": "02/12/2025",
        "effective_date_requested_new": "04/21/2025",
        "effective_date_requested_renewal": "06/05/2025",
        "serff_status": "Closed-Filed",
        "filing_description": "With this filing, Allstate is proposing changes to the Installment Fees and Late Payment Fee for the Allstate Indemnity\nCompany (AI) Manufactured Home (MFH) program in the state of Oregon.\nFurther information regarding these changes can be found in the enclosed attachments.\nThis change will apply to new business written on or after April 21, 2025 and for renewals effective on or after June 5, 2025.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 8,
        "company_codes": [
            19240
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "The rate filing by Allstate Indemnity Company for its AI MFH (Manufactured Home) program in the state of Oregon involves the proposed changes to installment fees and late payment fees. Specifically, the filing includes:\n\n1. Increasing the Installment Fee for the Allstate Easy Pay Plan from $1.50 to $2.00\n2. Increasing the Installment Fee for all other payment methods (excluding Allstate Payroll Deductions) from $4.00 to $5.00\n3. Continuing the practice of not charging Installment Fees for Allstate Payroll Deductions\n4. Increasing the Late Payment Fee from $10.00 to $15.00\n\nThese adjustments are detailed in the company's filing materials, including explanatory memorandums and supporting documents. The effective date for these changes is set for new business written on or after April 21, 2025, and for renewals effective on or after June 5, 2025. The filing was submitted on February 12, 2025, and closed-filed status was achieved on February 25, 2025. The primary contact for this filing is Adriana Cahue.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "OR_ALSE-134417934": {
        "serff_tr_num": "ALSE-134417934",
        "filing_type": "Rule",
        "date_submitted": "02/13/2025",
        "effective_date_requested_new": "04/21/2025",
        "effective_date_requested_renewal": "06/05/2025",
        "serff_status": "Closed-Filed",
        "filing_description": "With this filing, Allstate is proposing changes to the Installment Fees and Late Payment Fee for the Allstate Insurance\nCompany (AIC) Homeowners (HO), Condominium (CON) and Renters (REN) program in the state of Oregon.\nFurther information regarding these changes can be found in the enclosed attachments.\nThis change will apply to new business written on or after April 21, 2025 and for renewals effective on or after June 5, 2025.\nThis filing company is closed to new business. Allstate has, however, supplied a new business effective date for special\nbusiness cases. For example, to accommodate a new business policy in the same company to a policyholder that has been\nreinstated, or if a cancel/re-write is necessary.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 8,
        "company_codes": [
            19232
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "Based on the filing information provided by Allstate Insurance Company for the state of Oregon, the rate filing involves changes to the installment fees and late payment fees for their homeowners (HO), condominium (CON), and renters (REN) insurance program. Here is a summary of the rate filing:\n\n1. **Company Details:**\n   - Company Name: Allstate Insurance Company\n   - State: Oregon\n   - Type of Insurance: Homeowners, Condominium, Renters\n   - Product Name: AIC HO/CON/REN\n\n2. **Filing Details:**\n   - Filing Type: Rule\n   - Date Submitted: 02/13/2025\n   - Effective Date Requested for New Business: 04/21/2025\n   - Effective Date Requested for Renewals: 06/05/2025\n\n3. **Proposed Changes:**\n   - Increasing the Installment Fee for the Allstate Easy Pay Plan from $1.50 to $2.00.\n   - Increasing the Installment Fee for all other payment methods (excluding Allstate Payroll Deductions) from $4.00 to $5.00.\n   - Late Payment Fee to increase from $10.00 to $15.00.\n\n4. **Correspondence Summary:**\n   - Disposition Date: 02/26/2025\n   - Disposition Status: Filed\n   - Disposition: Rate data does NOT apply to filing",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "OR_ALSE-134417942": {
        "serff_tr_num": "ALSE-134417942",
        "filing_type": "Rule",
        "date_submitted": "02/13/2025",
        "effective_date_requested_new": "04/21/2025",
        "effective_date_requested_renewal": "06/05/2025",
        "serff_status": "Closed-Filed",
        "filing_description": "With this filing, Allstate is proposing changes to the Installment Fees and Late Payment Fee for the Allstate Indemnity\nCompany (AI) Homeowners (HO) program in the state of Oregon.\nFurther information regarding these changes can be found in the enclosed attachments.\nThis change will apply to new business written on or after April 21, 2025 and for renewals effective on or after June 5, 2025.\nThis filing company is closed to new business. Allstate has, however, supplied a new business effective date for special\nbusiness cases. For example, to accommodate a new business policy in the same company to a policyholder that has been\nreinstated, or if a cancel/re-write is necessary.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 8,
        "company_codes": [
            19240
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "Based on the filing submitted by Allstate Indemnity Company for their AI HO homeowners insurance program in the state of Oregon, the key changes proposed include:\n\n1. Increase in Installment Fees:\n   - Allstate Easy Pay Plan: from $1.50 to $2.00\n   - Other payment methods (except Allstate Payroll Deductions): from $4.00 to $5.00\n   - Allstate Payroll Deductions: No change (continues to have no Installment Fees)\n\n2. Increase in Late Payment Fee:\n   - From $10.00 to $15.00\n\nThe filing aims to implement these changes for new business written on or after April 21, 2025, and for renewals effective on or after June 5, 2025. The filing was submitted on 02/13/2025, reviewed by David Dahl, and disposition status indicates it was filed on 02/26/2025.\n\nAdditionally, the filing company details include:\n- Company Name: Allstate Indemnity Company\n- County of Domicile: Illinois\n- Contact Person: Adriana Cahue\n- Contact Email: acahu@allstate.com\n- Phone: 847-402-7877\n\nThe filing does not include rate data and is classified as a rule filing. The SERFF Tracking Number is ALSE-134417942. Further details are available in the enclosed attachments and supportive documents.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "OR_ALSE-134417973": {
        "serff_tr_num": "ALSE-134417973",
        "filing_type": "Rule",
        "date_submitted": "02/13/2025",
        "effective_date_requested_new": "04/21/2025",
        "effective_date_requested_renewal": "06/05/2025",
        "serff_status": "Closed-Filed",
        "filing_description": "With this filing, Allstate is proposing changes to the Installment Fees and Late Payment Fee for the Allstate Vehicle and\nProperty Insurance Company (AVPIC) Homeowners (HO) program in the state of Oregon.\nFurther information regarding these changes can be found in the enclosed attachments.\nThis change will apply to new business written on or after April 21, 2025 and for renewals effective on or after June 5, 2025.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 8,
        "company_codes": [
            37907
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "The rate filing from Allstate Vehicle and Property Insurance Company in Oregon pertains to their AVPIC Homeowners (HO) program. The filing proposes changes to the Installment Fees and Late Payment Fee. Specifically, the changes include:\n\n- Increasing the Installment Fee for the Allstate Easy Pay Plan from $1.50 to $2.00\n- Increasing the Installment Fee for all other payment methods, excluding Allstate Payroll Deductions, from $4.00 to $5.00\n- Continuing to have no Installment Fees for Allstate Payroll Deductions\n- Increasing the Late Payment Fee from $10.00 to $15.00\n\nThese changes will apply to new business written on or after April 21, 2025, and for renewals effective on or after June 5, 2025. For detailed derivation of these fees, refer to the Explanatory Memorandum attached to the filing.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "OR_ALSE-134418009": {
        "serff_tr_num": "ALSE-134418009",
        "filing_type": "Rule",
        "date_submitted": "02/13/2025",
        "effective_date_requested_new": "04/21/2025",
        "effective_date_requested_renewal": "06/05/2025",
        "serff_status": "Closed-Filed",
        "filing_description": "With this filing, Allstate is proposing changes to the Installment Fees and Late Payment Fee for the Allstate Property and\nCasualty Insurance Company (APC) Homeowners (HO) program in the state of Oregon.\nFurther information regarding these changes can be found in the enclosed attachments.\nThis change will apply to new business written on or after April 21, 2025 and for renewals effective on or after June 5, 2025.\nThis filing company is closed to new business. Allstate has, however, supplied a new business effective date for special\nbusiness cases. For example, to accommodate a new business policy in the same company to a policyholder that has been\nreinstated, or if a cancel/re-write is necessary.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 8,
        "company_codes": [
            17230
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "Based on the filing provided, Allstate Property and Casualty Insurance Company submitted a rate filing to the Oregon Department of Consumer and Business Services for their APC HO homeowners insurance product. The filing proposes changes to the Installment Fees and Late Payment Fee for policies in the state of Oregon. Here is a summary of the key changes in the rate filing:\n\n1. **Effective Dates:** \n   - Requested Effective Date (New): April 21, 2025\n   - Requested Effective Date (Renewal): June 5, 2025\n\n2. **Policy Changes:**\n   - Increasing the Installment Fee for the Allstate Easy Pay Plan from $1.50 to $2.00\n   - Increasing the Installment Fee for all other payment methods (excluding Allstate Payroll Deductions) from $4.00 to $5.00\n   - Maintaining no Installment Fees for Allstate Payroll Deductions\n   - Increasing the Late Payment Fee from $10.00 to $15.00\n\n3. **Project Details:**\n   - Product Name: APC HO\n   - Project Name/Number: Increase Installment Fees and Late Payment Fee / RITM06436026\n\n4. **Contacts:**\n   - Filing Contact: Adriana Cahue (acahu@allstate.com)\n   - Company Contact: Allstate Property and Casualty Insurance Company, 2775 Sanders Rd, Suite A2W, Northbrook,",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "OR_ALSE-134418028": {
        "serff_tr_num": "ALSE-134418028",
        "filing_type": "Rule",
        "date_submitted": "02/13/2025",
        "effective_date_requested_new": "04/21/2025",
        "effective_date_requested_renewal": "06/05/2025",
        "serff_status": "Closed-Filed",
        "filing_description": "With this filing, Allstate is proposing changes to the Installment Fees and Late Payment Fee for the Allstate Indemnity\nCompany (AI) Renters (REN) program in the state of Oregon.\nFurther information regarding these changes can be found in the enclosed attachments.\nThis change will apply to new business written on or after April 21, 2025 and for renewals effective on or after June 5, 2025.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 8,
        "company_codes": [
            19240
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "Based on the information provided in the filing, Allstate Indemnity Company submitted a rate filing to the Oregon Department of Consumer and Business Services for their AI REN renters program. The filing proposes changes to the Installment Fees and Late Payment Fee, specifically in the state of Oregon. Here is a summary of the key changes:\n\n- The Installment Fees for the Allstate Easy Pay Plan will be increased from $1.50 to $2.00.\n- The Installment Fees for all other payment methods (excluding Allstate Payroll Deductions) will be increased from $4.00 to $5.00.\n- Allstate Payroll Deductions will continue to have no Installment Fees.\n- The Late Payment Fee will be increased from $10.00 to $15.00.\n\nThese changes will apply to new business written on or after April 21, 2025, and for renewals effective on or after June 5, 2025. The rate filing was disposed on February 26, 2025, with a status of \"Filed.\" The effective date for the new changes is April 21, 2025, and for renewals is June 5, 2025.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "PA_LEMO-134412814": {
        "serff_tr_num": "LEMO-134412814",
        "filing_type": "Form",
        "date_submitted": "02/25/2025",
        "effective_date_requested_new": "05/27/2025",
        "effective_date_requested_renewal": "05/27/2025",
        "serff_status": "Closed-Approved",
        "filing_description": "A revision to Lemonade’s homeowners insurance program is hereby submitted for the State’s review. The Company\nrespectfully requests that this filing apply to all new and renewal business policies written on or after May 27, 2025.\nThe following forms are being submitted for the state’s review:\n- LEM-PA-NOTICE01 (02-25): Notice of Cancellation\n- LEM-PA-NOTICE02 (02-25): Notice of Refusal to Renew\nThese notices are being filed as a result of Lemonade’s Market Conduct Exam. As outlined with Vern Schmidt on January 30,\n2025, we will be attaching these formal notices of cancellation and nonrenewal as a PDF to our countrywide cancellation and\nnonrenewal notice emails to be compliant with the State regulations.\nWe look forward to your review.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 5032,
        "company_codes": [
            16023
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "Based on the information provided in the filing, Lemonade Insurance Company submitted a revision to its homeowners insurance program to the state of Pennsylvania for review and approval. The filing included updates to the Notice of Cancellation of Insurance and the Notice of Non-Renewal of Insurance forms. The company requested that these changes apply to all new and renewal business policies written on or after May 27, 2025.\n\nThe filing included detailed changes to the form types, form titles, and the addition of a mailing date field to the cancellation notices. Lemonade Insurance Company engaged in correspondence with the state regarding objections and responses related to the form changes, and ultimately, the disposition status was approved on March 3, 2025. The effective date for the new changes was set for May 27, 2025.\n\nOverall, the rate filing focused on updates and revisions to homeowners insurance policy forms related to cancellation and non-renewal notices in compliance with Pennsylvania state regulations.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "RI_LBPM-134392464": {
        "serff_tr_num": "LBPM-134392464",
        "filing_type": "Form",
        "date_submitted": "01/27/2025",
        "effective_date_requested_new": "04/19/2025",
        "effective_date_requested_renewal": "05/24/2025",
        "serff_status": "Closed-(02) Approved",
        "filing_description": "In accordance with Rhode Island filing requirements, we respectfully submit the following revisions for our Renters Line of\nBusiness program.\nThis filing updates Actual Cash Value (ACV), Your Duties to Maintain Policy Limits, and various style, formatting, and grammar\nchanges. Specifically, we have updated ACV to include reasonable deductions for materials, labor, overhead, and profit.\nAdditionally, Your Duties to maintain and Select Policy Limits is updated to remove pro rata language.\nThe information below/Exhibit 1 provides a list of forms submitted with this filing.  In addition, it also provides a summary of the\nmajor coverage or policies differences from our currently approved homeowner policy.\nOur company would like to have the option of reformatting text or moving boxes, where applicable, to accommodate marketing\nrequirements and printing of forms. The format of the forms may vary depending on the needs of our clients (e.g. paper size,\nelectronic distribution, etc.). The language will remain the same as approved by your Division and any font requirements will be\nmaintained.\nWe appreciate your review of this filing. Should you have any questions or concerns, please do not hesitate to contact me\ndirectly.\nThe following provides a summary for each form submitted with this filing.\nSpecial Provisions – Rhode Island, CHO-6104RIEP 4/25\n•Definition of actual cash value.\n•Updating your duties to select and maintain policy limits.\n•Cosmetic forms updates which have no coverage impacts",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 111,
        "company_codes": [
            24740
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "Based on the information provided in the filing, Safeco Insurance Company of America submitted revisions for their Renters Line of Business program to the Rhode Island Department of Insurance. The filing included updates to the Actual Cash Value (ACV) definition, Your Duties to Maintain Policy Limits, and various style and formatting changes. The revisions also included changes to the coverage for fungi, wet or dry rot, or bacteria, and collapse coverage.\n\nThe filing was submitted as a Form type on 01/27/2025, with the SERFF Tracking Number LBPM-134392464. The filing was reviewed and approved on 02/25/2025. The effective date requested for the new changes was 04/19/2025, with a renewal effective date of 05/24/2025.\n\nAmanda Scott, the State Filings Specialist at Safeco Insurance Company of America, was the individual responsible for the filing. The filing was related to the homeowners and tenant homeowners insurance product named Renters.\n\nIf you need more detailed information or a specific aspect of the filing, please let me know!",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "SC_AMSI-134171194": {
        "serff_tr_num": "AMSI-134171194",
        "filing_type": "Rate",
        "date_submitted": "11/25/2024",
        "effective_date_requested_new": "04/18/2025",
        "effective_date_requested_renewal": "06/18/2025",
        "serff_status": "Closed-Approved",
        "filing_description": "American Strategic Insurance Corp. (ASIC) respectfully submits for your review a filing for our HOS program. Please see our\nExplanatory Memorandum for additional detail.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 155,
        "company_codes": [
            10872
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "Summary of the Rate Filing by American Strategic Insurance Corp.:\n\n1. **Company Details:**\n   - **Company Name:** American Strategic Insurance Corp\n   - **State:** South Carolina\n   - **Product Name:** Homeowners\n   - **Filing Type:** Rate\n   - **Date Submitted:** 11/25/2024\n   - **Effective Date Requested (New):** 04/18/2025\n   - **Effective Date Requested (Renewal):** 06/18/2025\n\n2. **Rate Information:**\n   - **Rate Change Type:** Increase\n   - **Overall Percentage of Last Rate Revision:** 23.000%\n   - **Effective Date of Last Rate Revision:** 04/17/2024\n   - **Overall % Indicated Change:** 20.300%\n   - **Overall % Rate Impact:** 13.200%\n   - **Written Premium Change for this Program:** $1,876,579\n   - **Number of Policyholders Affected:** 7,691\n   - **Written Premium for this Program:** $14,169,813\n\n3. **Territory Factors for Wind/Hail and Other Perils:**\n   - The rate manual includes territory factors for different zip codes, with varying factors for wind/hail and other perils.\n\n4. **Dwelling Coverage Amounts for Other Perils and Wind/Hail:**\n   - The rate manual",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "SC_LBPM-134400516": {
        "serff_tr_num": "LBPM-134400516",
        "filing_type": "Form",
        "date_submitted": "01/31/2025",
        "effective_date_requested_new": "05/19/2025",
        "effective_date_requested_renewal": "06/23/2025",
        "serff_status": "Closed-Approved as Amended",
        "filing_description": "In accordance with South Carolina’s filing provision, we respectfully submit the following revisions for our Homeowners,\nCondo, and Simple Renters program.\nThe information below provides a list of forms submitted with this filing.  In addition, it also provides a summary of the major\ncoverage or policies differences from our currently approved Homeowners, Condo, and Simple Renters policies.\nOur company would like to have the option of reformatting text or moving boxes, where applicable, to accommodate marketing\nrequirements and printing of forms. The format of the forms may vary depending on the needs of our clients (e.g. paper size,\nelectronic distribution, etc.). The language will remain the same as approved by your Division and any font requirements will be\nmaintained.\nWe appreciate your review of this filing. Should you have any questions or concerns, please do not hesitate to contact me\ndirectly.\nPlease reference the included forms exhibit for the summary of changes.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 111,
        "company_codes": [
            42404,
            23035,
            23043,
            33600,
            12484
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "The rate filing pertains to a South Carolina homeowners, condo, and simple renters program submitted by Liberty Insurance Corporation. The filing included revisions for their Homeowners, Condo, and Simple Renters policies. The filing requested an effective date of 05/19/2025 for new policies and 06/23/2025 for renewals. The status of the filing was \"Approved as Amended,\" with a disposition date of 02/28/2025. The filing involved companies under the Liberty Mutual Group and had no overall percentage rate impact or change in the number of policyholders affected. Additionally, the filing had a 1.57% market share in South Carolina for the line of business.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "SC_LBPM-134401992": {
        "serff_tr_num": "LBPM-134401992",
        "filing_type": "Form",
        "date_submitted": "02/04/2025",
        "effective_date_requested_new": "05/19/2025",
        "effective_date_requested_renewal": "06/23/2025",
        "serff_status": "Closed-Approved as Amended",
        "filing_description": "In accordance with South Carolina’s filing provision, we respectfully submit the following revisions for our Homeowners and\nCondo program.\nThe information below provides a list of forms submitted with this filing.  In addition, it also provides a summary of the major\ncoverage or policies differences from our currently approved Homeowners and Condo policy.\nOur company would like to have the option of reformatting text or moving boxes, where applicable, to accommodate marketing\nrequirements and printing of forms. The format of the forms may vary depending on the needs of our clients (e.g. paper size,\nelectronic distribution, etc.). The language will remain the same as approved by your Division and any font requirements will be\nmaintained.\nWe appreciate your review of this filing. Should you have any questions or concerns, please do not hesitate to contact us\ndirectly.\nPlease reference the included forms exhibit for the summary of changes.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 111,
        "company_codes": [
            42404,
            33600
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "In this rate filing submitted by Liberty Insurance Corporation and LM Insurance Corporation for their homeowners insurance product in South Carolina, the primary changes include a revision to their [Policy Type] Insurance Application (Form PROP 0017) to update the cancellation policy from \"90 days\" to \"120 days\" in compliance with Statute 38-75-1200. The effective dates requested for the new policy are 05/19/2025 and for renewals are 06/23/2025. The filing was reviewed and approved as amended by the South Carolina Department of Insurance on 03/03/2025, with a disposition status of \"Approved as Amended.\" Additionally, no rate changes were indicated in this filing, and there were no impacts on the overall written premium or the number of policyholders affected.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "SC_LBPM-134406290": {
        "serff_tr_num": "LBPM-134406290",
        "filing_type": "Form",
        "date_submitted": "02/06/2025",
        "effective_date_requested_new": "05/19/2025",
        "effective_date_requested_renewal": "06/23/2025",
        "serff_status": "Closed-Approved",
        "filing_description": "In accordance with South Carolina’s filing provision, we respectfully submit the following revisions for our Homeowners and\nSimple Renters program.\nThe information below provides a list of forms submitted with this filing.  In addition, it also provides a summary of the major\ncoverage or policies differences from our currently approved Homeowners and Simple Renters policies.\nOur company would like to have the option of reformatting text or moving boxes, where applicable, to accommodate marketing\nrequirements and printing of forms. The format of the forms may vary depending on the needs of our clients (e.g. paper size,\nelectronic distribution, etc.). The language will remain the same as approved by your Division and any font requirements will be\nmaintained.\nPlease kindly note that we are having to update the non-renewal notice period from 90 days to 60 days, in accordance with SC\n38-75-740. This forms change was previously approved under LBPM-133638640, but the new form was inadvertently not\nimplemented.\nWe appreciate your review of this filing. Should you have any questions or concerns, please do not hesitate to contact us\ndirectly.\nPlease reference the included forms exhibit for the summary of changes.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 111,
        "company_codes": [
            23043,
            12484
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "Based on the information provided from the filing, here is a summary of the rate filing made by Liberty Mutual Insurance Company:\n\n- Company: Liberty Mutual Insurance Company\n- Product Name: Homeowners\n- State: South Carolina\n- Filing Type: Form\n- Date Submitted: 02/06/2025\n- SERFF Tracking Number: LBPM-134406290\n- SERFF Status: Closed-Approved\n- State Tracking Numbers: 384557, 384558\n- Company Tracking Number: 25-SC-LM-HO-RNT-F-MULTI-PCF\n- Effective Date Requested (New): 05/19/2025\n- Effective Date Requested (Renewal): 06/23/2025\n\nThe filing involved updates and revisions to the Homeowners and Simple Renters program in South Carolina, including changes to the non-renewal notice period from 90 days to 60 days in accordance with SC 38-75-740. The revisions also allow for reformatting text or moving boxes to accommodate marketing requirements and printing needs. The forms affected include LMHO 2100SC, LMHM 8900, and PROP 0017. The disposition date for the filing was 03/03/2025, with an approved status. The rate change impact was indicated as 0.000%.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "TN_HART-134429213": {
        "serff_tr_num": "HART-134429213",
        "filing_type": "Rule",
        "date_submitted": "02/28/2025",
        "effective_date_requested_new": "07/01/2025",
        "effective_date_requested_renewal": "07/01/2025",
        "serff_status": "Assigned",
        "filing_description": "We are filing for your information the introduction of a credit card surcharge to The Hartford’s Home products in the writing\ncompanies referenced above.\nOur proposal, which is a common practice across various industries, involves the transfer of credit card payment processing to\na third-party payment vendor. Policyholders who choose to pay their premium by credit card will incur a credit card surcharge\ncharged, collected and retained by a third-party payment vendor, which will not exceed 3% of the total payment amount.\nTherefore, we are not submitting any rate or rule pages at this time in connection with this proposal.  The surcharge\npercentage will not differ from policyholder to policyholder, regardless of payment amount or payment plan. The Hartford will\ncontinue to offer payment options that will not be subject to a surcharge.  The surcharge amount will be shown at the time of\nthe transaction and is effective for all transactions processed on or after July 01, 2025.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 91,
        "company_codes": [
            29424,
            37478,
            38261,
            30104,
            34690,
            11000,
            27120,
            29459,
            22357,
            19682
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "The insurance company, Hartford Casualty Insurance Company along with several affiliated companies, has filed a rate change in the state of Tennessee for homeowners insurance. The rate filing introduces a credit card surcharge for policyholders who choose to pay their premiums via credit card. The credit card surcharge, not exceeding 3% of the total payment amount, will be collected by a third-party payment vendor starting from July 01, 2025. The filing does not involve any rate or rule changes but rather introduces this new surcharge practice. The proposal aims to streamline payment processing by transferring it to a third-party vendor, providing policyholders with an additional payment option.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "TN_LBPM-134412900": {
        "serff_tr_num": "LBPM-134412900",
        "filing_type": "Form",
        "date_submitted": "02/11/2025",
        "effective_date_requested_new": "05/17/2025",
        "effective_date_requested_renewal": "06/26/2025",
        "serff_status": "Closed-Approved",
        "filing_description": "In accordance with Tennessee filing requirements, we respectfully submit the following revisions for our Renters/Condominium\nLine of Business program.\nThis filing updates Actual Cash Value (ACV), Your Duties to Maintain Policy Limits, and various style, formatting, and grammar\nchanges. Specifically, we have updated ACV to include reasonable deductions for materials, labor, overhead, and profit.\nAdditionally, Your Duties to maintain and Select Policy Limits is updated to remove pro rata language.\nThe information below/Exhibit 1 provides a list of forms submitted with this filing.  In addition, it also provides a summary of the\nmajor coverage or policies differences from our currently approved homeowner policy.\nOur company would like to have the option of reformatting text or moving boxes, where applicable, to accommodate marketing\nrequirements and printing of forms. The format of the forms may vary depending on the needs of our clients (e.g. paper size,\nelectronic distribution, etc.). The language will remain the same as approved by your Division and any font requirements will be\nmaintained.\nWe appreciate your review of this filing. Should you have any questions or concerns, please do not hesitate to contact us\ndirectly.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 111,
        "company_codes": [
            24732,
            24740,
            24724
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "From the provided filing with a DOI, it appears that the insurance company, General Insurance Company of America, has submitted a rate filing for their Homeowners insurance product in Tennessee. The rate filing includes revisions to the coverage related to Fungi, Wet or Dry Rot, or Bacteria. Additionally, changes have been made to Actual Cash Value, Your Duties to Maintain Policy Limits, and various style, formatting, and grammar adjustments within the policy.\n\nThe rate filing introduces additional coverage for Fungi, Wet or Dry Rot, or Bacteria, providing up to $10,000 for various aspects related to the presence or removal of these elements in covered property. Furthermore, there are provisions addressing Collapse coverage and specific exclusions related to intentional loss and duties of the insured regarding policy limits.\n\nOverall, the rate filing has been approved, and the effective date for the new provisions is requested to be on May 17, 2025, for new policies and June 26, 2025, for renewals. The rate impact for this filing appears to be neutral, with no change indicated for written premiums or the number of policyholders affected.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "TN_LBPM-134434596": {
        "serff_tr_num": "LBPM-134434596",
        "filing_type": "Rate",
        "date_submitted": "02/26/2025",
        "effective_date_requested_new": "04/25/2025",
        "effective_date_requested_renewal": "06/06/2025",
        "serff_status": "Assigned",
        "filing_description": "In accordance with Tennessee’s regulatory provision, American Economy Insurance Company (AEIC) is respectfully\nsubmitting the following revision to its Homeowners rating program.\nWith this change, updates are being made to homeowner base rates, peril offset factors and multi-policy discount factors and\nresult in a -0.3% impact.\nThe new business effective date is on or after April 25, 2025 and renewal business is June 6, 2025.\nWe appreciate your review of this filing and look forward to your acknowledgement of our submission. Please feel free to\ncontact us with any questions or concerns.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 111,
        "company_codes": [
            19690
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "Based on the information provided in the filing, here is a summary of the rate filing by American Economy Insurance Company for the state of Tennessee:\n\n- Company: American Economy Insurance Company\n- Product Name: Homeowners\n- Filing Type: Rate\n- Date Submitted: 02/26/2025\n- Effective Date Requested (New): 04/25/2025\n- Effective Date Requested (Renewal): 06/06/2025\n- Filing Method: Prior Approval\n- Rate Change Type: Decrease\n- Overall Percentage of Last Rate Revision: 0.000%\n- Overall Rate Impact: -0.3%\n- Written Premium Change: $-135,222\n- Number of Policy Holders Affected: 15,428\n- Written Premium for this Program: $52,086,141\n- Rate Impact Details: Updates to homeowner base rates, peril offset factors, and multi-policy discount factors resulting in a -0.3% impact\n- Filing Fees: Retaliatory fee and multiple rate filing fee totaling $285.00\n- Project Contact: Matthew Rowland, State Filings Specialist\n\nIn summary, the rate filing for American Economy Insurance Company in Tennessee involves a decrease in rates for their Homeowners product, with specific adjustments to base rates, peril offset factors, and multi-policy discount factors. The filing was submitted for prior approval, and the company is requesting an effective date of 04/25/",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "TN_USAA-134436312": {
        "serff_tr_num": "USAA-134436312",
        "filing_type": "Rate/Rule",
        "date_submitted": "02/26/2025",
        "effective_date_requested_new": "06/09/2025",
        "effective_date_requested_renewal": "08/25/2025",
        "serff_status": "Assigned",
        "filing_description": "Based on a review of the latest Homeowner experience, United Services Automobile Association (USAA), USAA-Casualty\nInsurance Company (USAA-CIC), USAA-General Indemnity Company (USAA-GIC), and Garrison Property and Casualty\nInsurance Company (Garrison) propose a change to claims free discount factors with an overall effect of 0.0% to be effective\n6/9/2025 for new business and 8/25/2025 for renewal business.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 200,
        "company_codes": [
            25941,
            25968,
            18600,
            21253
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "The rate filing pertains to a proposed change in claims free discount factors for homeowners insurance under the product name \"HOMEOWNERS\" in Tennessee. The filing was submitted by United Services Automobile Association and its subsidiaries USAA Casualty Insurance Company, USAA General Indemnity Company, and Garrison Property and Casualty Insurance Company. The proposed change is specified to have an overall effect of 0.0% and is scheduled to be effective on June 9, 2025, for new business and August 25, 2025, for renewal business. The filing includes detailed rate information, company tracking numbers, contact information, and explanations of the changes in discount factors and their impact on premiums.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "TX_ALSE-133994457": {
        "serff_tr_num": "ALSE-133994457",
        "filing_type": "Rate/Rule",
        "date_submitted": "02/14/2024",
        "effective_date_requested_new": "02/26/2024",
        "effective_date_requested_renewal": "04/11/2024",
        "serff_status": "Closed-CL-Closed; No additional info required at this time",
        "filing_description": "With this filing, Allstate is proposing an overall 12.5% rate level change to the Allstate Vehicle and Property Insurance\nCompany (AVPIC) Homeowners - Owner Occupied Homeowners (HO) program in the state of Texas.\nAllstate is proposing revisions to the following rating plans: Rate Adjustment Factors, Retained Risk Provision (RRP) Base\nRate Factors, RRP Rate Adjustment Factor and RRP Zone Definitions. The overall rate level change has been achieved\nthrough revision of the Rate Level Factors. Further information regarding these changes can be found in the enclosed\nattachments.\nThis change will apply to new business written on or after 2/26/2024 and for renewals effective on or after 4/11/2024.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 8,
        "company_codes": [
            37907
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "The rate filing is for the Allstate Vehicle and Property Insurance Company's AVPIC Homeowners - Owner Occupied Homeowners program in the state of Texas. The filing proposes an overall 12.5% rate level change, achieved through revisions to Rate Adjustment Factors, Retained Risk Provision Base Rate Factors, RRP Rate Adjustment Factor, and RRP Zone Definitions. The changes are detailed in various documents including exhibits, actuarial support, and a filing memorandum. The proposed rate change applies to new business written on or after 2/26/2024 and for renewals effective on or after 4/11/2024. The company tracking number for this filing is R56546: RAF (+12.5%). The filing was submitted on 02/14/2024 and the disposition status is Closed with no additional information required at this time.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "TX_ALSE-133994492": {
        "serff_tr_num": "ALSE-133994492",
        "filing_type": "Rate/Rule",
        "date_submitted": "02/14/2024",
        "effective_date_requested_new": "02/26/2024",
        "effective_date_requested_renewal": "04/11/2024",
        "serff_status": "Closed-CL-Closed; No additional info required at this time",
        "filing_description": "With this filing, Allstate is proposing an overall 6.7% rate level change to the Allstate Indemnity Company (AI) Manufactured\nHome program in the state of Texas.\nThe overall rate level change has been achieved through revision of the Rate Adjustment Factor and Reinsurance Rate\nAdjustment Factor. Further information regarding these changes can be found in the enclosed attachments.\nThis change will apply to new business written on or after 2/26/2024 and for renewals effective on or after 4/11/2024.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 8,
        "company_codes": [
            19240
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "Based on the attached documents from Allstate Indemnity Company regarding their rate filing for manufactured homes in Texas, the following key points can be highlighted:\n\n1. **Rate Adjustment**: The company is proposing an overall rate level change of 6.7% for the Allstate Indemnity Company (AI) Manufactured Home program in Texas. This change will apply to new business written on or after 02/26/2024 and for renewals effective on or after 04/11/2024.\n  \n2. **Filing Details**: The filing covers the Allstate Indemnity Company's AI Manufactured Home program within the Homeowners and Mobile Homeowners categories in Texas.\n\n3. **Actuarial Support**: The filing includes Actuarial Support documents, such as Exhibit D and Exhibit E, which provide detailed information supporting the rate adjustments proposed by the company.\n\n4. **SERFF Tracking**: The filing details include the SERFF Tracking Number as ALSE-133994492, State Tracking Number as S719100, and Company Tracking Number as R56416.\n\n5. **Filing Memorandum**: The filing contains a comprehensive Filing Memorandum outlining the rate adjustments and other relevant details.\n\n6. **Dispositions**: The filing has been closed with no additional information required as of 02/27/2025.\n\n7. **Objection Response**: The company has responded to an objection letter dated 04/11/2024, addressing specific requirements",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "TX_ALSE-133995002": {
        "serff_tr_num": "ALSE-133995002",
        "filing_type": "Rate/Rule",
        "date_submitted": "02/15/2024",
        "effective_date_requested_new": "02/26/2024",
        "effective_date_requested_renewal": "04/11/2024",
        "serff_status": "Closed-CL-Closed; No additional info required at this time",
        "filing_description": "With this filing, Allstate is proposing an overall 3.9% rate level change to the Allstate Texas Lloyds (ATL) Homeowners (HO)\nprogram in the state of Texas.\nThe overall rate level change has been achieved through revision of the Rate Adjustment Factor. Further information regarding\nthese changes can be found in the enclosed attachments.\nThis change will apply to new business written on or after 2/26/2024 and for renewals effective on or after 4/11/2024.\nThis filing company is closed to new business. Allstate has, however, supplied a new business effective date for special\nbusiness cases. For example, to accommodate a new business policy in the same company to a policyholder that has been\nreinstated, or if a cancel/re-write is necessary.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 8,
        "company_codes": [
            26530
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "The information provided in the attachment pertains to the actuarial analysis and adjustments made by Allstate Texas Lloyd’s for weather and non-weather losses, specifically focusing on water, lightning, and wind/hail perils in Texas. Here is a summary of the key points discussed in the attachment:\n\n1. **Underlying Data:** Allstate Texas Lloyd’s considers historical loss experience for water, lightning, and wind/hail perils when determining the indicated provision for losses. The analysis includes allocated loss adjustment expenses (ALAE) and is done using a maximum of five accident years.\n\n2. **Severity Accident Year Weights:** Each accident year is assigned a credibility weight when determining the severity provisions for weather losses. A 20% weight is typically assigned to each accident year to ensure a stable indication.\n\n3. **Severity Development:** Ultimate accident year weather severity is determined using the Link Ratio method, which assumes that future development is proportional to losses that have already emerged. No additive loss development is estimated for weather losses.\n\n4. **Severity Trend:** Historical trend analyses for each peril (water, lightning, wind/hail) are conducted, and trends are selected based on past results, data credibility, and actuarial judgment. These trends are then projected for the future policy period.\n\n5. **Adjustments due to Underwriting Actions:** Historical data is adjusted to account for underwriting actions taken by Allstate, such as redefining coastal zones and implementing policy exclusions. Adjustment factors are applied",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "TX_GMMX-134436826": {
        "serff_tr_num": "GMMX-134436826",
        "filing_type": "Rate/Rule",
        "date_submitted": "02/26/2025",
        "effective_date_requested_new": "03/26/2025",
        "effective_date_requested_renewal": "",
        "serff_status": "Submitted to State",
        "filing_description": "This filing details revisions to the Imperial Fire and Casualty Insurance Company Homeowners line of business in the state of\nTexas. No existing policyholders are impacted by these changes.\nThis filing proposes revisions to the following:\n- Base Rates and Fixed Expense Premium\n- Package Discount\n- Removal of Automatic Trend Factor\n- Price Match Table\n- Renters Minimum Premium\nNo indication was run for this filing, ‘0’ entered for Overall % Indicated Change.\nPlease refer to the enclosed filing for more information.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 8,
        "company_codes": [
            44369
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "Based on the detailed filing provided, it appears that Allstate utilized the Fama-French Three-factor Model and the Discounted Cash Flow Model to calculate the appropriate underwriting profit provision. The filing contains various financial calculations and analyses related to determining the cost of equity capital, developing the underwriting profit provision, estimating investment income, and calculating the necessary pre-tax underwriting profit provision.\n\nKey points from the filing include:\n1. Allstate calculated the cost of equity capital using the Fama-French Three-factor Model and the Discounted Cash Flow Model.\n2. The underwriting profit provision was calculated based on the cost of equity, market-to-book ratios, dividend payout ratios, and other financial metrics.\n3. Investment income on equity and policyholder-supplied funds were factored into the calculation of the underwriting profit provision.\n4. Various financial ratios and averages were used to determine the income needed by the company and the appropriate underwriting profit provision.\n5. Allstate's tax rate on underwriting income was reported as 21%.\n\nIn summary, the filing showcases a comprehensive analysis of financial data and methodologies used by Allstate to calculate the underwriting profit provision, providing insights into the company's pricing strategies and financial soundness.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "TX_LBPM-134367508": {
        "serff_tr_num": "LBPM-134367508",
        "filing_type": "Endorsement (Amendments)",
        "date_submitted": "01/09/2025",
        "effective_date_requested_new": "04/19/2025",
        "effective_date_requested_renewal": "06/25/2025",
        "serff_status": "Closed-APDR-Approved by Director",
        "filing_description": "We are submitting revisions to our and endorsement for our Homeowner’s program.\nThe endorsement form is being edited for style and formatting changes. Additionally, we are changing it from a countrywide\nform to a state specific form.\nOur company would like to have the option of reformatting text or moving boxes, where applicable, to accommodate marketing\nrequirements and printing of forms. The format of the forms may vary depending on the needs of our clients (e.g. paper size,\nelectronic distribution, etc.). The language will remain the same as approved by your Division and any font requirements will be\nmaintained.\nWe appreciate your review of this filing. Should you have any questions or concerns, please do not hesitate to contact me\ndirectly.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 111,
        "company_codes": [
            19690
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "Based on the information provided in the filing, the rate filing submitted by American Economy Insurance Company for their Homeowners insurance product in Texas involved an Endorsement (Amendments) under TOI 04.0 Homeowners/04.0000 Homeowners Sub-TOI Combinations. The filing was designated as LBPM-134367508 with a State Tracking number of S726909 and a Company Tracking number of 25-TX-S-HO-F-HMR2-END.\n\nThe company's effective dates requested for the filing were 04/19/2025 for new policies and 06/25/2025 for renewals. The filing was made on 01/09/2025 and had an APDR-Approved by Director status with a disposition date of 02/17/2025. The Filing Contact was Beth Coffey, and the Filing Company was American Economy Insurance Company, part of the Liberty Mutual Group.\n\nThe filing involved revisions to the Special Personal Property Coverage form (HOM-7308/TXEP) to make style and formatting changes, as well as transitioning it from a countrywide to a state-specific form. The revisions included adjustments to coverage for specific perils and property types in the Personal Property We Cover section.\n\nThe filing also included various supporting documents, such as an Explanatory Memorandum and a Summary of Changes exhibit. Additionally, the company indicated its willingness to adjust the format of the forms to meet marketing and distribution needs within",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "UT_LBPM-134409711": {
        "serff_tr_num": "LBPM-134409711",
        "filing_type": "Form",
        "date_submitted": "02/07/2025",
        "effective_date_requested_new": "04/19/2025",
        "effective_date_requested_renewal": "05/24/2025",
        "serff_status": "Closed-FILED FOR USE",
        "filing_description": "BY SUBMITTING THIS FILING, I CERTIFY THAT THE ATTACHED FILING HAS BEEN COMPLETED IN ACCORDANCE\nWITH UTAH ADMINISTRATIVE RULE R590-225 AND IS IN COMPLIANCE WITH APPLICABLE UTAH LAWS AND RULES.\nIn accordance with Utah's filing provision, we are submitting the following revisions to our property lines Renter/Condo\nprograms.\nWe have filed revisions to our Renter/Condo program endorsements\n•Definition of actual cash value.\n•Updating your duties to select and maintain policy limits.\nOur company would like to have the option of reformatting text or moving boxes, where applicable, to accommodate marketing\nrequirements and printing of forms. The format of the forms may vary depending on the needs of our clients (e.g. paper size,\nelectronic distribution, etc.). The language will remain the same as approved by your department and any font requirements\nwill be maintained.\nWe appreciate your review of this filing. Should you have any questions or concerns, please do not hesitate to contact us\ndirectly.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 111,
        "company_codes": [
            24740
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "The rate filing submitted by Safeco Insurance Company of America to the Utah Insurance Department consists of revisions to their Homeowners insurance program in Utah. The filing includes updates to the Special Provisions related to fungi, wet or dry rot, or bacteria coverage, collapse coverage, and additional property coverages. The revisions also address definitions, property conditions, and liability coverages. The changes provide clarity on coverage, exclusions, duties after loss, and suit against the insurer. The filing demonstrates Safeco's commitment to enhancing their insurance offerings and ensuring compliance with Utah laws and regulations.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "VA_AMSI-134375543": {
        "serff_tr_num": "AMSI-134375543",
        "filing_type": "Form",
        "date_submitted": "01/10/2025",
        "effective_date_requested_new": "01/10/2025",
        "effective_date_requested_renewal": "01/10/2025",
        "serff_status": "Closed-Filed",
        "filing_description": "Per the Department's request in filing AMSI-134111672, we respectfully submit this request to withdraw the following forms as\nthey are no longer in production: ASI HO VA SSH 06 15, HO 05 22 07 97, and HO 23 65 04 91. Please do not hesitate to\nreach out to us should you have any questions or concerns.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 155,
        "company_codes": [
            10872
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "The rate filing submitted by American Strategic Insurance Corp to the Department of Insurance in Virginia involves the withdrawal of three forms: ASI HO VA SSH 06 15, HO 05 22 07 97, and HO 23 65 04 91. The filing was submitted on January 10, 2025, and the disposition date was March 3, 2025, with a filing status of \"Filed.\" The effective date requested for both new and renewal policies was January 10, 2025. The filing included multiple objection and response letters regarding the withdrawal of the forms and their production status. The forms were confirmed to have ceased production on specific dates in 2023, and the company clarified the number of policies still utilizing the forms. The rate filing also addressed increased special limits of liability under Coverage C - Personal Property in Virginia. The status of the forms involved in the filing was changed to \"Withdrawn\" as per the schedule items.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "VA_HART-134429350": {
        "serff_tr_num": "HART-134429350",
        "filing_type": "Rate/Rule",
        "date_submitted": "02/26/2025",
        "effective_date_requested_new": "07/01/2025",
        "effective_date_requested_renewal": "07/01/2025",
        "serff_status": "Submitted to State",
        "filing_description": "We are filing for your information the introduction of a credit card surcharge to The Hartford’s Home products in the writing\ncompanies referenced above.\nOur proposal, which is a common practice across various industries, involves the transfer of credit card payment processing to\na third-party payment vendor. Policyholders who choose to pay their premium by credit card will incur a credit card surcharge\ncharged, collected and retained by a third-party payment vendor, which will not exceed 3% of the total payment amount.\nTherefore, we are not submitting any rate or rule pages at this time in connection with this proposal.  The surcharge\npercentage will not differ from policyholder to policyholder, regardless of payment amount, payment plan, channel or product.\nThe Hartford will continue to offer payment options that will not be subject to a surcharge.  The surcharge amount will be\nshown at the time of the transaction and is effective for all transactions processed on or after July 01, 2025.\nThis is not a rate filing.  Due to constraints in the SERFF system for the state of Virginia, we had to input this as a rate/rule\nfiling for the filing to be successfully submitted.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 91,
        "company_codes": [
            29424,
            37478,
            38261,
            34690,
            27120,
            29459,
            19682,
            30104
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "This rate filing pertains to the introduction of a credit card surcharge for The Hartford's Home products in various insurance companies under The Hartford umbrella. The proposal involves transferring credit card payment processing to a third-party vendor, resulting in policyholders who choose to pay by credit card incurring a surcharge not exceeding 3% of the total payment amount. The surcharge will be applied uniformly and will be effective for all transactions processed on or after July 1, 2025. It is emphasized that this filing is not a rate filing but was classified as such due to system constraints in the state of Virginia. The filing was prepared by Lesdy Richard, Senior Pricing Analyst, and any inquiries should be directed to her.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "VA_TRVD-G134337488": {
        "serff_tr_num": "TRVD-G134337488",
        "filing_type": "Rate/Rule",
        "date_submitted": "12/06/2024",
        "effective_date_requested_new": "12/06/2024",
        "effective_date_requested_renewal": "01/25/2025",
        "serff_status": "Closed-Filed",
        "filing_description": "With this filing we are proposing changes to our Quantum Homeowners 2.0 (Homeowners) product, please see the\nExplanatory Memorandum for a complete description of the changes.\nThe overall impact of this filing is +0.0%.\nThis change applies to new business issued and effective on or after 12/6/2024, and to renewal business issued on or after\n12/6/2024 and effective on or after 1/25/2025.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 3548,
        "company_codes": [
            38130
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "The rate filing for the Quantum Home 2.0 product by Travelers Personal Insurance Company in Virginia involved proposed changes to their Homeowners product. The filing indicated an overall impact of +0.0%, with the changes applying to new business effective from 12/6/2024 and renewal business effective from 1/25/2025. The filing included various rate and rule manuals, supporting documents, and certifications related to the proposed changes.\n\nThe status of the filing was marked as \"Filed\" with an effective date of 12/6/2024 for new business and 1/25/2025 for renewal business. The disposition date was 2/26/2025, indicating that the filing was successfully processed. It was a Rate/Rule filing type under the Homeowners category. The project was identified by the number 77081, and the filing tracking number was TRVD-G134337488. The filing pertained to the Virginia insurance market.\n\nThe filing company, Travelers Personal Insurance Company, outlined the proposed changes and provided details on the impact, effective dates, authorship, review process, and contact information for regulatory inquiries. The filing also included objection letters, responses, and correspondence summaries related to the filing process. Overall, the filing appeared to have been successfully addressed and reconciled with the regulatory requirements in Virginia.",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "WA_GMMX-134441494": {
        "serff_tr_num": "GMMX-134441494",
        "filing_type": "Form",
        "date_submitted": "02/28/2025",
        "effective_date_requested_new": "07/01/2025",
        "effective_date_requested_renewal": "07/01/2025",
        "serff_status": "Assigned",
        "filing_description": "Updating our home line state amendments to comply with the WA S 5798 nonrenewal 60 day required timeline.",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 8,
        "company_codes": [
            10358
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "The rate filing you provided includes several amendments and provisions related to property coverage for homes and personal liability insurance. Here is a summary of the key changes and information gathered from the filing:\n\n1. **Insurance Company:** Encompass Insurance Company\n2. **State:** Washington\n3. **Type of Insurance:** Homeowners insurance\n4. **Product Name:** WA EIC PROPERTY C360 LAW CHANGE 48.18.290 & 48.18.2901\n5. **Effective Date Requested:** 07/01/2025\n6. **Filing Type:** Form\n7. **Author:** Angie Gillespie\n8. **Reviewer:** Dennis Godwin\n9. **General Information:** The filing involves updating home line state amendments to comply with the WA S 5798 nonrenewal 60-day required timeline.\n\n### Changes in Definitions:\n- Amendment Of Dwelling Fire Provisions include revised definitions of Bodily Injury, Domestic Abuse, Actual Cash Value, and Replacement Cost.\n- Amendment Of Elite Home Provisions includes changes in the definitions of Bodily Injury, Domestic Abuse, Actual Cash Value, and Replacement Cost.\n\n### Key Provisions:\n- **Real Property - Insuring Agreement:** Provides details about coverage for dwellings and structures on the residence premises.\n- **Limit Of Liability:** Specifies the covered losses settled on a replacement cost basis.\n- **Tangible Personal Property - Limit Of Liability:** Outlines the covered losses and settlement basis for tangible personal property.\n-",
        "o1_mini_summary": "",
        "xai_summary": ""
    },
    "WV_AMSI-134244221": {
        "serff_tr_num": "AMSI-134244221",
        "filing_type": "Rate/Rule",
        "date_submitted": "01/28/2025",
        "effective_date_requested_new": "08/06/2025",
        "effective_date_requested_renewal": "10/06/2025",
        "serff_status": "Closed-Approved",
        "filing_description": "American Strategic Insurance Corp. (ASIC) proposes to update our existing homeowners (HOH) product in West Virginia.\nJames Bennett\nProduct Manager\nJames_S_Bennett@progressive.com",
        "filing_method": "",
        "toi": "04.0 Homeowners",
        "group_code": 155,
        "company_codes": [
            10872
        ],
        "download_week": "2025-03-03T00:00:00",
        "gpt_3_5_summary": "The rate filing submitted by American Strategic Insurance Corp for their Homeowners product in West Virginia includes a proposed rate increase with an overall indicated change of 8.000%. The filing was submitted on 01/28/2025 and approved with an effective date of 08/06/2025 for new business and 10/06/2025 for renewals. The filing included various documents such as rate pages, rules manual, actuarial summary, certification, rate change histogram, and more.\n\nThe base rates and territory factors were included in the filing, with details on different aspects such as Tornado, Wind, Hail, Water Backup, Fire, Liability, Theft, Earthquake, and more. The company proposed adjustments to the HOH Rules Manual and responded to objections raised during the review process.\n\nOverall, the filing detailed the proposed rate changes, supporting documents, correspondence summaries, objections raised, and responses provided by the company. The filing fees amounted to $100 per company, and the status of the filing was marked as closed and approved.",
        "o1_mini_summary": "",
        "xai_summary": ""
    }
}